/* automatically generated by rust-bindgen 0.64.0 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]

pub const Cmd_CreateSEEWorld_Args_flags_EnableDebug: u32 = 65536;
pub const Cmd_CreateSEEWorld_Args_flags__reserved: u32 = 4294901760;
pub const Cmd_CreateSEEWorld_Args_flags__allflags: u32 = 65536;
pub const Cmd_CreateSEEWorld_Args_flags__presentflags: u32 = 0;
pub const Cmd_LoadBuffer_Args_flags_Final: u32 = 1;
pub const Cmd_LoadBuffer_Args_flags_flashsegment_present: u32 = 2;
pub const Cmd_LoadBuffer_Args_flags__reserved: u32 = 4294901760;
pub const Cmd_LoadBuffer_Args_flags__allflags: u32 = 3;
pub const Cmd_LoadBuffer_Args_flags__presentflags: u32 = 2;
pub const NFastApp_ConnectionFlags_Privileged: u32 = 1;
pub const NFastApp_ConnectionFlags_NoClientID: u32 = 2;
pub const NFastApp_ConnectionFlags_ForceClientID: u32 = 4;
pub type uint32 = ::core::ffi::c_uint;
pub type M_Word = uint32;
pub type M_MustBeZeroWord = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_ByteBlock {
    pub len: M_Word,
    pub ptr: *mut ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_M_ByteBlock() {
    const UNINIT: ::core::mem::MaybeUninit<M_ByteBlock> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ByteBlock>(),
        16usize,
        concat!("Size of: ", stringify!(M_ByteBlock))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ByteBlock>(),
        8usize,
        concat!("Alignment of ", stringify!(M_ByteBlock))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ByteBlock),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ByteBlock),
            "::",
            stringify!(ptr)
        )
    );
}
impl Default for M_ByteBlock {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_StringASCII = *mut ::core::ffi::c_char;
pub type M_StringUTF8 = M_StringASCII;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_ASCIIString {
    pub ptr: M_StringASCII,
}
#[test]
fn bindgen_test_layout_M_ASCIIString() {
    const UNINIT: ::core::mem::MaybeUninit<M_ASCIIString> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ASCIIString>(),
        8usize,
        concat!("Size of: ", stringify!(M_ASCIIString))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ASCIIString>(),
        8usize,
        concat!("Alignment of ", stringify!(M_ASCIIString))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ASCIIString),
            "::",
            stringify!(ptr)
        )
    );
}
impl Default for M_ASCIIString {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_ValInfo {
    pub code: ::core::ffi::c_uint,
    pub string: *const ::core::ffi::c_char,
}
#[test]
fn bindgen_test_layout_M_ValInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_ValInfo> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ValInfo>(),
        16usize,
        concat!("Size of: ", stringify!(M_ValInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ValInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(M_ValInfo))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ValInfo),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ValInfo),
            "::",
            stringify!(string)
        )
    );
}
impl Default for M_ValInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_Tag = M_Word;
pub type M_KeyID = M_Word;
pub type M_ModuleID = M_Word;
pub type M_SlotID = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NFast_Bignum {
    _unused: [u8; 0],
}
pub type M_Bignum = *mut NFast_Bignum;
pub const Status_OK: M_Status = 0;
pub const Status_UnknownCommand: M_Status = 1;
pub const Status_NotYetImplemented: M_Status = 2;
pub const Status_Malformed: M_Status = 3;
pub const Status_UnknownID: M_Status = 4;
pub const Status_AccessDenied: M_Status = 5;
pub const Status_ObjectInUse: M_Status = 6;
pub const Status_UseLimitExceeded: M_Status = 7;
pub const Status_TimeLimitExceeded: M_Status = 8;
pub const Status_BadCertKeyHash: M_Status = 9;
pub const Status_BadCertSignature: M_Status = 10;
pub const Status_VerifyFailed: M_Status = 11;
pub const Status_TypeMismatch: M_Status = 12;
pub const Status_BadShareState: M_Status = 13;
pub const Status_BadTokenData: M_Status = 14;
pub const Status_NoMemory: M_Status = 15;
pub const Status_Failed: M_Status = 16;
pub const Status_UnknownParameter: M_Status = 17;
pub const Status_UnknownFlag: M_Status = 18;
pub const Status_BlobTypeUnknown: M_Status = 19;
pub const Status_BufferFull: M_Status = 20;
pub const Status_UnitReset: M_Status = 21;
pub const Status_ClientUnknown: M_Status = 22;
pub const Status_CrossModule: M_Status = 23;
pub const Status_InvalidParameter: M_Status = 24;
pub const Status_InvalidState: M_Status = 25;
pub const Status_InvalidModule: M_Status = 26;
pub const Status_TokenAssemblyFailed: M_Status = 27;
pub const Status_UnknownKM: M_Status = 28;
pub const Status_LogTokenNotPresent: M_Status = 29;
pub const Status_InvalidMonitorMultiple: M_Status = 30;
pub const Status_DecryptFailed: M_Status = 31;
pub const Status_WriteProtected: M_Status = 33;
pub const Status_OutOfRange: M_Status = 34;
pub const Status_PrivilegedCommand: M_Status = 35;
pub const Status_UnknownSlot: M_Status = 36;
pub const Status_UnknownKeyHash: M_Status = 37;
pub const Status_TokenAuthFailed: M_Status = 38;
pub const Status_UnknownMechanism: M_Status = 39;
pub const Status_NoSpaceOnToken: M_Status = 40;
pub const Status_TokenNotFormatted: M_Status = 41;
pub const Status_UnknownTokenType: M_Status = 42;
pub const Status_TokenIOError: M_Status = 43;
pub const Status_EncryptFailed: M_Status = 44;
pub const Status_InvalidACL: M_Status = 45;
pub const Status_MetaDataProtection: M_Status = 46;
pub const Status_PhysTokenNotPresent: M_Status = 47;
pub const Status_MechanismNotExpected: M_Status = 48;
pub const Status_UnknownDefault: M_Status = 49;
pub const Status_AttemptedDowngrade: M_Status = 50;
pub const Status_SlotFull: M_Status = 51;
pub const Status_UnknownChallenge: M_Status = 52;
pub const Status_AsynchNotification: M_Status = 53;
pub const Status_InvalidData: M_Status = 54;
pub const Status_HardwareFailed: M_Status = 55;
pub const Status_ServerNotRunning: M_Status = 56;
pub const Status_OSErrorErrno: M_Status = 57;
pub const Status_TransactionNotFound: M_Status = 58;
pub const Status_TransactionNotYetComplete: M_Status = 59;
pub const Status_ServerConnectionLost: M_Status = 60;
pub const Status_ServerFailed: M_Status = 61;
pub const Status_StrictFIPS140: M_Status = 62;
pub const Status_UnknownStatus: M_Status = 63;
pub const Status_Cancelled: M_Status = 64;
pub const Status_UnsupportedChannelType: M_Status = 65;
pub const Status_ArithmeticError: M_Status = 66;
pub const Status_OpStackOverflow: M_Status = 67;
pub const Status_OpStackUnderflow: M_Status = 68;
pub const Status_NegativeResult: M_Status = 69;
pub const Status_HostDataInvalid: M_Status = 70;
pub const Status_HostDataAccessFailed: M_Status = 71;
pub const Status_NoUpcall: M_Status = 72;
pub const Status_NotAvailable: M_Status = 73;
pub const Status_MalformedCertificate: M_Status = 74;
pub const Status_InvalidCertificate: M_Status = 75;
pub const Status_ObjectNotReady: M_Status = 76;
pub const Status_BadMachineImage: M_Status = 77;
pub const Status_BadWorldImage: M_Status = 78;
pub const Status_SEEWorldFailed: M_Status = 79;
pub const Status_SoftwareFailed: M_Status = 80;
pub const Status_NoHostMemory: M_Status = 81;
pub const Status_NoModuleMemory: M_Status = 82;
pub const Status_IncorrectToken: M_Status = 83;
pub const Status_OperationFailed: M_Status = 84;
pub const Status_HostDataAccessDenied: M_Status = 86;
pub const Status_InvalidMergedKey: M_Status = 87;
pub const Status_AlreadyExists: M_Status = 88;
pub const Status_ReadOnly: M_Status = 89;
pub const Status_RemoteServerFailed: M_Status = 90;
pub const Status_SlotUnconnected: M_Status = 91;
pub const Status_NSTBadMessage: M_Status = 92;
pub const Status_nCErrno: M_Status = 93;
pub const Status_ImpathNotReady: M_Status = 94;
pub const Status_ImpathTimeLimitExceeded: M_Status = 95;
pub const Status_ImpathDataLimitExceeded: M_Status = 96;
pub const Status_ImpathReplay: M_Status = 97;
pub const Status_ImpathMsgTypeMismatch: M_Status = 98;
pub const Status_NoKXGroup: M_Status = 99;
pub const Status_ServerAccessDenied: M_Status = 100;
pub const Status_InProgress: M_Status = 101;
pub const Status_InvalidRM: M_Status = 102;
pub const Status_InvalidSlot: M_Status = 103;
pub const Status_UnknownPermID: M_Status = 104;
pub const Status_ForeignTokenLocked: M_Status = 105;
pub const Status_OperationTimeout: M_Status = 106;
pub const Status_SSLUnexpectedMessage: M_Status = 107;
pub const Status_SSLBadRecordMac: M_Status = 108;
pub const Status_SSLDecryptionFailed: M_Status = 109;
pub const Status_SSLRecordOverFlow: M_Status = 110;
pub const Status_SSLDecompressionFailure: M_Status = 111;
pub const Status_SSLHandshakeFailure: M_Status = 112;
pub const Status_SSLNoCertificate: M_Status = 113;
pub const Status_SSLBadCertificate: M_Status = 114;
pub const Status_SSLUnsupportedCertificate: M_Status = 115;
pub const Status_SSLCertificateRevoked: M_Status = 116;
pub const Status_SSLCertificateExpired: M_Status = 117;
pub const Status_SSLCertificateUnknown: M_Status = 118;
pub const Status_SSLIllegalParameter: M_Status = 119;
pub const Status_SSLUnknownCA: M_Status = 120;
pub const Status_SSLAccessDenied: M_Status = 121;
pub const Status_SSLDecodeError: M_Status = 122;
pub const Status_SSLDecryptError: M_Status = 123;
pub const Status_SSLExportRestriction: M_Status = 124;
pub const Status_SSLProtocolVersion: M_Status = 125;
pub const Status_SSLInsufficientSecurity: M_Status = 126;
pub const Status_SSLInternalError: M_Status = 127;
pub const Status_SSLUserCanceled: M_Status = 128;
pub const Status_SSLNoRenogotiation: M_Status = 129;
pub const Status_UnknownKey: M_Status = 130;
pub const Status_UserCancelled: M_Status = 131;
pub const Status_KeyNotLoaded: M_Status = 132;
pub const Status_HostUnknownKeyType: M_Status = 133;
pub const Status_IncorrectRepositoryName: M_Status = 134;
pub const Status_NoUsableModules: M_Status = 135;
pub const Status_InvalidHostDataIdentifier: M_Status = 136;
pub const Status_WorldUnusable: M_Status = 137;
pub const Status_MalformedPassphrase: M_Status = 138;
pub const Status_UnknownFileDevice: M_Status = 139;
pub const Status_TooManyLinks: M_Status = 140;
pub const Status_UseLimitsUnavailable: M_Status = 141;
pub const Status_Busy: M_Status = 142;
pub const Status_SecurityWorldFeatureDisabled: M_Status = 143;
pub const Status_ModuleNotUsable: M_Status = 144;
pub const Status_InappropriateObject: M_Status = 145;
pub const Status_InvalidImage: M_Status = 147;
pub const Status_InvalidModuleType: M_Status = 148;
pub const Status_RQCardUnwantedSlot: M_Status = 149;
pub const Status_RQCardUnwantedModule: M_Status = 150;
pub const Status_RQCardNeedPassphrase: M_Status = 151;
pub const Status_RQCardNeedConfirm: M_Status = 152;
pub const Status_RQCardUserCancelled: M_Status = 153;
pub const Status_RQCardMustContinue: M_Status = 154;
pub const Status_RQCardAlreadyProcessed: M_Status = 155;
pub const Status_UnknownHostVolume: M_Status = 156;
pub const Status_InvalidPathName: M_Status = 157;
pub const Status_InvalidFileName: M_Status = 158;
pub const Status_DeprecatedMechanism: M_Status = 159;
pub const Status_NetworkHSMUILockoutNotConfigured: M_Status = 160;
pub const Status_DboxEarlyExit: M_Status = 161;
pub const Status_CommandLocked: M_Status = 162;
pub const Status_CannotEncode: M_Status = 163;
pub const Status_DataOutstanding: M_Status = 164;
pub const Status_InvalidKeyType: M_Status = 176;
pub const Status_UnexpectedlyShallowNesting: M_Status = 177;
pub const Status_UnexpectedlyDeepNesting: M_Status = 178;
pub const Status_Accepted: M_Status = 179;
pub const Status_IncorrectKPSName: M_Status = 180;
pub const Status_UserAuthFailed: M_Status = 181;
pub const Status_UnknownKeyHashNEI: M_Status = 182;
pub const Status_TDMNotRegistered: M_Status = 183;
pub const Status_TDMNoSiblings: M_Status = 184;
pub const Status_IncorrectBlobFormat: M_Status = 185;
pub const Status_PythonException: M_Status = 186;
pub const Status_StreamOperationFailed: M_Status = 187;
pub const Status_SQLError: M_Status = 188;
pub const Status_SQLInternalError: M_Status = 189;
pub const Status_SQLInvalidHandle: M_Status = 190;
pub const Status_SQLNoSuchRow: M_Status = 191;
pub const Status_FragmentationError: M_Status = 192;
pub const Status_SEEJobRejected: M_Status = 193;
pub const Status_SeeHostcallProviderLock: M_Status = 194;
pub const Status_SeeHostcallProvisionFailed: M_Status = 195;
pub const Status_SeeStreamUnsupportedOperation: M_Status = 196;
pub const Status_SeeStreamInvalidDescriptor: M_Status = 197;
pub const Status_SeeStreamUnsupportedCreation: M_Status = 198;
pub const Status_SeeStreamUnexpectedResetErrorState: M_Status = 199;
pub const Status_RQCardTokenOperationFailed: M_Status = 200;
pub const Status_SeeHostcallProvisionLost: M_Status = 201;
pub const Status_DBINoRecord: M_Status = 202;
pub const Status_DBIOrphan: M_Status = 203;
pub const Status_DBIExists: M_Status = 204;
pub const Status_DBICorrupt: M_Status = 205;
pub const Status_DoesNotExist: M_Status = 206;
pub const Status_KPServerFailed: M_Status = 207;
pub const Status_KPSAuthorisationFailed: M_Status = 208;
pub const Status_SeeHostcallOperationFailed: M_Status = 209;
pub const Status_ConfigFileError: M_Status = 210;
pub const Status_SoftwareTooOld: M_Status = 211;
pub const Status_SEEWorldNotPresent: M_Status = 212;
pub const Status_UnknownESN: M_Status = 213;
pub const Status_InvalidKPReply: M_Status = 214;
pub const Status_KeyAlreadyExists: M_Status = 215;
pub const Status_IncorrectKeyStored: M_Status = 216;
pub const Status_NotManagementConnection: M_Status = 217;
pub const Status_GuardianNotStarted: M_Status = 218;
pub const Status_GuardianStarted: M_Status = 219;
pub const Status_GuardianNotSuspended: M_Status = 220;
pub const Status_GuardianSuspended: M_Status = 221;
pub const Status_GuardianDisabled: M_Status = 222;
pub const Status_GuardianNotMaster: M_Status = 223;
pub const Status_GuardianIsMaster: M_Status = 224;
pub const Status_GuardianStateTooOld: M_Status = 225;
pub const Status_InvalidCreateRegionParams: M_Status = 226;
pub const Status_UnknownRegion: M_Status = 227;
pub const Status_RegionAlreadyExists: M_Status = 228;
pub const Status_TrieInvalidPath: M_Status = 229;
pub const Status_TrieKeyPathInconsistent: M_Status = 230;
pub const Status_TrieInconsistentParameters: M_Status = 231;
pub const Status_TrieKeyMismatch: M_Status = 232;
pub const Status_DBITransactionLost: M_Status = 233;
pub const Status_UnrecoverableRegion: M_Status = 234;
pub const Status_UnknownEntityType: M_Status = 235;
pub const Status_InvalidEntityType: M_Status = 236;
pub const Status_InvalidObjspec: M_Status = 237;
pub const Status_CommandReplyMismatch: M_Status = 238;
pub const Status_ConflictingParameters: M_Status = 239;
pub const Status_DataMismatch: M_Status = 240;
pub const Status_UnknownGuardian: M_Status = 241;
pub const Status_NoActiveKey: M_Status = 242;
pub const Status_DataChangedDuringOperation: M_Status = 243;
pub const Status_NoGroupPermission: M_Status = 244;
pub const Status_DBIOutOfDate: M_Status = 245;
pub const Status_SQLConnectionLost: M_Status = 246;
pub const Status_SQLDeadlock: M_Status = 247;
pub const Status_UnknownFormat: M_Status = 248;
pub const Status_AppkeysetAlreadyExists: M_Status = 249;
pub const Status_DuplicateGroupEntry: M_Status = 250;
pub const Status_EntityAlreadyExists: M_Status = 251;
pub const Status_GroupAlreadyExists: M_Status = 252;
pub const Status_GroupPermissionAlreadyExists: M_Status = 253;
pub const Status_KeysetAlreadyExists: M_Status = 254;
pub const Status_NoSuchAppKeyset: M_Status = 255;
pub const Status_NoSuchEntityID: M_Status = 256;
pub const Status_NoSuchEntityName: M_Status = 257;
pub const Status_NoSuchGroup: M_Status = 258;
pub const Status_NoSuchGroupEntry: M_Status = 259;
pub const Status_NoSuchGroupPermission: M_Status = 260;
pub const Status_NoSuchKey: M_Status = 261;
pub const Status_NoSuchKeyset: M_Status = 262;
pub const Status_NoSuchKgdc: M_Status = 263;
pub const Status_UnknownEnrolID: M_Status = 264;
pub const Status_VerifyGuardianStateCertFailed: M_Status = 265;
pub const Status_VerifyKgdcCertFailed: M_Status = 266;
pub const Status_VerifyKgdiCertFailed: M_Status = 267;
pub const Status_VerifyKgkdcpCertFailed: M_Status = 268;
pub const Status_IncompatibleFormat: M_Status = 269;
pub const Status_TrieKeyNotFound: M_Status = 271;
pub const Status_TrieKeyAlreadyExists: M_Status = 272;
pub const Status_UnknownKPSName: M_Status = 273;
pub const Status_DBIResynchronize: M_Status = 274;
pub const Status_StrictFIPSSecurityLevel: M_Status = 275;
pub const Status_MalformedFlashTable: M_Status = 276;
pub const Status_GuardianIsOnStandby: M_Status = 277;
pub const Status_KPSConnectionLost: M_Status = 278;
pub const Status_KPSNoActiveMaster: M_Status = 279;
pub const Status_DBICorruptRecordHash: M_Status = 280;
pub const Status_DBICorruptOrderMismatch: M_Status = 281;
pub const Status_CertMissing: M_Status = 282;
pub const Status_TimeOutOfRange: M_Status = 283;
pub const Status_KPSServiceError: M_Status = 284;
pub const Status_CardNotLoaded: M_Status = 285;
pub const Status_UnknownDatabaseType: M_Status = 286;
pub const Status_KPSSigningKeyMismatch: M_Status = 287;
pub const Status_NoMastersConfigured: M_Status = 288;
pub const Status_NoModulesConfigured: M_Status = 289;
pub const Status_RTCWentBackwards: M_Status = 290;
pub const Status_NewKPSKeys: M_Status = 291;
pub const Status_StarterSystemLimitsExceeded: M_Status = 292;
pub const Status_InvalidDebugLogLevel: M_Status = 293;
pub const Status_ModuleApplicationNotSupported: M_Status = 294;
pub const Status_ModuleMonitorNotSupported: M_Status = 295;
pub const Status_InvalidWarrant: M_Status = 296;
pub const Status_InvalidWarrantRoot: M_Status = 297;
pub const Status_HostDeviceDriverNotSupported: M_Status = 298;
pub const Status_AlreadyConfigured: M_Status = 299;
pub const Status_NotYetConfigured: M_Status = 300;
pub const Status_ModuleNotWarranted: M_Status = 301;
pub const Status_TokenSecureChannelError: M_Status = 302;
pub const Status_TokenMessageError: M_Status = 303;
pub const Status_TooManyDynamicSlotOperations: M_Status = 304;
pub const Status_SynchronizationInitFailed: M_Status = 306;
pub const Status_TokenCommandTimeout: M_Status = 307;
pub const Status_UnlistedCard: M_Status = 308;
pub const Status_FrontPanelRemoteLocked: M_Status = 310;
pub const Status_RemoteLockoutModeNotConfigured: M_Status = 311;
pub const Status_CommandCannotHaveState: M_Status = 312;
pub const Status_NotPoolModule: M_Status = 313;
pub const Status_CommonCriteriaCMTSRestrictions: M_Status = 314;
pub const Status_TokenTransactionRolledBack: M_Status = 315;
pub const Status_TokenTransactionCorrupted: M_Status = 316;
pub const Status_ConnectionClosed: M_Status = 318;
pub const Status_TokenSecureChannelVersionError: M_Status = 321;
pub const Status_InvalidInterfaceName: M_Status = 322;
pub const Status__Max: M_Status = 323;
pub type M_Status = ::core::ffi::c_uint;
pub const nCErrno_UNKNOWN: M_nCErrno = 1;
pub const nCErrno_EPERM: M_nCErrno = 2;
pub const nCErrno_ENOENT: M_nCErrno = 3;
pub const nCErrno_ESRCH: M_nCErrno = 4;
pub const nCErrno_EINTR: M_nCErrno = 5;
pub const nCErrno_EIO: M_nCErrno = 6;
pub const nCErrno_ENXIO: M_nCErrno = 7;
pub const nCErrno_E2BIG: M_nCErrno = 8;
pub const nCErrno_ENOEXEC: M_nCErrno = 9;
pub const nCErrno_EBADF: M_nCErrno = 10;
pub const nCErrno_ECHILD: M_nCErrno = 11;
pub const nCErrno_EAGAIN: M_nCErrno = 12;
pub const nCErrno_ENOMEM: M_nCErrno = 13;
pub const nCErrno_EACCES: M_nCErrno = 14;
pub const nCErrno_EFAULT: M_nCErrno = 15;
pub const nCErrno_ENOTBLK: M_nCErrno = 16;
pub const nCErrno_EBUSY: M_nCErrno = 17;
pub const nCErrno_EEXIST: M_nCErrno = 18;
pub const nCErrno_EXDEV: M_nCErrno = 19;
pub const nCErrno_ENODEV: M_nCErrno = 20;
pub const nCErrno_ENOTDIR: M_nCErrno = 21;
pub const nCErrno_EISDIR: M_nCErrno = 22;
pub const nCErrno_EINVAL: M_nCErrno = 23;
pub const nCErrno_ENFILE: M_nCErrno = 24;
pub const nCErrno_EMFILE: M_nCErrno = 25;
pub const nCErrno_ENOTTY: M_nCErrno = 26;
pub const nCErrno_ETXTBSY: M_nCErrno = 27;
pub const nCErrno_EFBIG: M_nCErrno = 28;
pub const nCErrno_ENOSPC: M_nCErrno = 29;
pub const nCErrno_ESPIPE: M_nCErrno = 30;
pub const nCErrno_EROFS: M_nCErrno = 31;
pub const nCErrno_EMLINK: M_nCErrno = 32;
pub const nCErrno_EPIPE: M_nCErrno = 33;
pub const nCErrno_EDOM: M_nCErrno = 34;
pub const nCErrno_ERANGE: M_nCErrno = 35;
pub const nCErrno_EDEADLK: M_nCErrno = 36;
pub const nCErrno_ENAMETOOLONG: M_nCErrno = 37;
pub const nCErrno_ENOLCK: M_nCErrno = 38;
pub const nCErrno_ENOSYS: M_nCErrno = 39;
pub const nCErrno_ENOTEMPTY: M_nCErrno = 40;
pub const nCErrno_ELOOP: M_nCErrno = 41;
pub const nCErrno_EWOULDBLOCK: M_nCErrno = 42;
pub const nCErrno_ENOMSG: M_nCErrno = 43;
pub const nCErrno_EIDRM: M_nCErrno = 44;
pub const nCErrno_EDEADLOCK: M_nCErrno = 45;
pub const nCErrno_EREMOTE: M_nCErrno = 46;
pub const nCErrno_EOVERFLOW: M_nCErrno = 47;
pub const nCErrno_EBADFD: M_nCErrno = 48;
pub const nCErrno_EILSEQ: M_nCErrno = 49;
pub const nCErrno_EUSERS: M_nCErrno = 50;
pub const nCErrno_ENOTSOCK: M_nCErrno = 51;
pub const nCErrno_EDESTADDRREQ: M_nCErrno = 52;
pub const nCErrno_EMSGSIZE: M_nCErrno = 53;
pub const nCErrno_EPROTOTYPE: M_nCErrno = 54;
pub const nCErrno_ENOPROTOOPT: M_nCErrno = 55;
pub const nCErrno_EPROTONOSUPPORT: M_nCErrno = 56;
pub const nCErrno_ESOCKTNOSUPPORT: M_nCErrno = 57;
pub const nCErrno_EOPNOTSUPP: M_nCErrno = 58;
pub const nCErrno_EPFNOSUPPORT: M_nCErrno = 59;
pub const nCErrno_EAFNOSUPPORT: M_nCErrno = 60;
pub const nCErrno_EADDRINUSE: M_nCErrno = 61;
pub const nCErrno_EADDRNOTAVAIL: M_nCErrno = 62;
pub const nCErrno_ENETDOWN: M_nCErrno = 63;
pub const nCErrno_ENETUNREACH: M_nCErrno = 64;
pub const nCErrno_ENETRESET: M_nCErrno = 65;
pub const nCErrno_ECONNABORTED: M_nCErrno = 66;
pub const nCErrno_ECONNRESET: M_nCErrno = 67;
pub const nCErrno_ENOBUFS: M_nCErrno = 68;
pub const nCErrno_EISCONN: M_nCErrno = 69;
pub const nCErrno_ENOTCONN: M_nCErrno = 70;
pub const nCErrno_ESHUTDOWN: M_nCErrno = 71;
pub const nCErrno_ETOOMANYREFS: M_nCErrno = 72;
pub const nCErrno_ETIMEDOUT: M_nCErrno = 73;
pub const nCErrno_ECONNREFUSED: M_nCErrno = 74;
pub const nCErrno_EHOSTDOWN: M_nCErrno = 75;
pub const nCErrno_EHOSTUNREACH: M_nCErrno = 76;
pub const nCErrno_EALREADY: M_nCErrno = 77;
pub const nCErrno_EINPROGRESS: M_nCErrno = 78;
pub const nCErrno_ESTALE: M_nCErrno = 79;
pub const nCErrno_EREMOTEIO: M_nCErrno = 80;
pub const nCErrno_EDQUOT: M_nCErrno = 81;
pub const nCErrno__Max: M_nCErrno = 82;
pub type M_nCErrno = ::core::ffi::c_uint;
pub const CrossModReason_ExplicitRequest: M_CrossModReason = 1;
pub const CrossModReason_Key: M_CrossModReason = 2;
pub const CrossModReason_Mode: M_CrossModReason = 4;
pub const CrossModReason_HardwareFailed: M_CrossModReason = 5;
pub const CrossModReason_UnitReset: M_CrossModReason = 6;
pub const CrossModReason_ServerKey: M_CrossModReason = 7;
pub const CrossModReason_ServerUnitReset: M_CrossModReason = 8;
pub const CrossModReason_NotPresent: M_CrossModReason = 9;
pub const CrossModReason_NToken: M_CrossModReason = 11;
pub const CrossModReason_NetworkError: M_CrossModReason = 12;
pub const CrossModReason_NoPoolModuleSupport: M_CrossModReason = 13;
pub const CrossModReason__Max: M_CrossModReason = 14;
pub type M_CrossModReason = ::core::ffi::c_uint;
pub const NetworkAddressFamily_INET: M_NetworkAddressFamily = 2;
pub const NetworkAddressFamily_INET6: M_NetworkAddressFamily = 10;
pub const NetworkAddressFamily_HOST: M_NetworkAddressFamily = 19;
pub const NetworkAddressFamily__Max: M_NetworkAddressFamily = 20;
pub type M_NetworkAddressFamily = ::core::ffi::c_uint;
pub const KeyHashMech_SHA1Hash: M_KeyHashMech = 44;
pub const KeyHashMech_SHA256Hash: M_KeyHashMech = 93;
pub const KeyHashMech_SHA512Hash: M_KeyHashMech = 95;
pub const KeyHashMech__Max: M_KeyHashMech = 96;
pub type M_KeyHashMech = ::core::ffi::c_uint;
pub const SlotType_Unknown: M_SlotType = 0;
pub const SlotType_DataKey: M_SlotType = 1;
pub const SlotType_SmartCard: M_SlotType = 2;
pub const SlotType_Emulated: M_SlotType = 3;
pub const SlotType_SoftToken: M_SlotType = 4;
pub const SlotType_Unconnected: M_SlotType = 5;
pub const SlotType__Max: M_SlotType = 6;
pub type M_SlotType = ::core::ffi::c_uint;
pub const PlainTextType_Bytes: M_PlainTextType = 1;
pub const PlainTextType_Hash: M_PlainTextType = 2;
pub const PlainTextType_Bignum: M_PlainTextType = 3;
pub const PlainTextType_Hash16: M_PlainTextType = 4;
pub const PlainTextType_ECPoint: M_PlainTextType = 5;
pub const PlainTextType_Hash24: M_PlainTextType = 6;
pub const PlainTextType_Hash32: M_PlainTextType = 7;
pub const PlainTextType_Hash48: M_PlainTextType = 8;
pub const PlainTextType_Hash64: M_PlainTextType = 9;
pub const PlainTextType_Hash28: M_PlainTextType = 10;
pub const PlainTextType__Max: M_PlainTextType = 11;
pub type M_PlainTextType = ::core::ffi::c_uint;
pub const ChannelType_Any: M_ChannelType = 0;
pub const ChannelType_Simple: M_ChannelType = 1;
pub const ChannelType__Max: M_ChannelType = 2;
pub type M_ChannelType = ::core::ffi::c_uint;
pub const ChannelMode_Encrypt: M_ChannelMode = 1;
pub const ChannelMode_Decrypt: M_ChannelMode = 2;
pub const ChannelMode_Sign: M_ChannelMode = 3;
pub const ChannelMode_Verify: M_ChannelMode = 4;
pub const ChannelMode__Max: M_ChannelMode = 5;
pub type M_ChannelMode = ::core::ffi::c_uint;
pub const CertType_Invalid: M_CertType = 0;
pub const CertType_SigningKey: M_CertType = 1;
pub const CertType_SingleCert: M_CertType = 2;
pub const CertType_SEECert: M_CertType = 3;
pub const CertType__Max: M_CertType = 4;
pub type M_CertType = ::core::ffi::c_uint;
pub const KeyType_Any: M_KeyType = 0;
pub const KeyType_RSAPublic: M_KeyType = 1;
pub const KeyType_RSAPrivate: M_KeyType = 2;
pub const KeyType_DSAPublic: M_KeyType = 3;
pub const KeyType_DHPublic: M_KeyType = 5;
pub const KeyType_DHPrivate: M_KeyType = 6;
pub const KeyType_Random: M_KeyType = 7;
pub const KeyType_DES: M_KeyType = 11;
pub const KeyType_DES3: M_KeyType = 12;
pub const KeyType_None: M_KeyType = 13;
pub const KeyType_ArcFour: M_KeyType = 15;
pub const KeyType_CAST: M_KeyType = 18;
pub const KeyType_DSAPrivate: M_KeyType = 19;
pub const KeyType_DSAComm: M_KeyType = 20;
pub const KeyType_Void: M_KeyType = 21;
pub const KeyType_Wrapped: M_KeyType = 23;
pub const KeyType_DKTemplate: M_KeyType = 24;
pub const KeyType_HMACMD5: M_KeyType = 26;
pub const KeyType_HMACSHA1: M_KeyType = 27;
pub const KeyType_HMACRIPEMD160: M_KeyType = 28;
pub const KeyType_Serpent: M_KeyType = 29;
pub const KeyType_Rijndael: M_KeyType = 30;
pub const KeyType_Twofish: M_KeyType = 31;
pub const KeyType_CAST256: M_KeyType = 32;
pub const KeyType_Blowfish: M_KeyType = 33;
pub const KeyType_HMACSHA256: M_KeyType = 34;
pub const KeyType_HMACSHA384: M_KeyType = 35;
pub const KeyType_HMACSHA512: M_KeyType = 36;
pub const KeyType_HMACTiger: M_KeyType = 37;
pub const KeyType_KCDSAPublic: M_KeyType = 39;
pub const KeyType_KCDSAPrivate: M_KeyType = 40;
pub const KeyType_DES2: M_KeyType = 41;
pub const KeyType_KCDSAComm: M_KeyType = 42;
pub const KeyType_SEED: M_KeyType = 43;
pub const KeyType_ECPublic: M_KeyType = 44;
pub const KeyType_ECPrivate: M_KeyType = 45;
pub const KeyType_ECDSAPublic: M_KeyType = 46;
pub const KeyType_ECDSAPrivate: M_KeyType = 47;
pub const KeyType_ECDHPrivate: M_KeyType = 48;
pub const KeyType_ECDHPublic: M_KeyType = 49;
pub const KeyType_HMACSHA224: M_KeyType = 50;
pub const KeyType_ARIA: M_KeyType = 51;
pub const KeyType_Camellia: M_KeyType = 52;
pub const KeyType_ECDHLaxPrivate: M_KeyType = 53;
pub const KeyType_ECDHLaxPublic: M_KeyType = 54;
pub const KeyType_DSACommVariableSeed: M_KeyType = 55;
pub const KeyType_DSACommFIPS186_3: M_KeyType = 56;
pub const KeyType_X25519Public: M_KeyType = 59;
pub const KeyType_X25519Private: M_KeyType = 60;
pub const KeyType_Ed25519Public: M_KeyType = 65;
pub const KeyType_Ed25519Private: M_KeyType = 66;
pub const KeyType_TUAKSubscriber: M_KeyType = 67;
pub const KeyType_TUAKTOP: M_KeyType = 68;
pub const KeyType_TUAKTOPC: M_KeyType = 69;
pub const KeyType_DHExPublic: M_KeyType = 73;
pub const KeyType_DHExPrivate: M_KeyType = 74;
pub const KeyType__Max: M_KeyType = 75;
pub type M_KeyType = ::core::ffi::c_uint;
pub const ECName_Custom: M_ECName = 1;
pub const ECName_NISTP192: M_ECName = 2;
pub const ECName_NISTP224: M_ECName = 3;
pub const ECName_NISTP256: M_ECName = 4;
pub const ECName_NISTP384: M_ECName = 5;
pub const ECName_NISTP521: M_ECName = 6;
pub const ECName_NISTB163: M_ECName = 7;
pub const ECName_NISTB233: M_ECName = 8;
pub const ECName_NISTB283: M_ECName = 9;
pub const ECName_NISTB409: M_ECName = 10;
pub const ECName_NISTB571: M_ECName = 11;
pub const ECName_NISTK163: M_ECName = 12;
pub const ECName_NISTK233: M_ECName = 13;
pub const ECName_NISTK283: M_ECName = 14;
pub const ECName_NISTK409: M_ECName = 15;
pub const ECName_NISTK571: M_ECName = 16;
pub const ECName_ANSIB163v1: M_ECName = 17;
pub const ECName_ANSIB191v1: M_ECName = 18;
pub const ECName_SECP160r1: M_ECName = 19;
pub const ECName_CustomLCF: M_ECName = 20;
pub const ECName_SECP256k1: M_ECName = 22;
pub const ECName_BrainpoolP160r1: M_ECName = 23;
pub const ECName_BrainpoolP160t1: M_ECName = 24;
pub const ECName_BrainpoolP192r1: M_ECName = 25;
pub const ECName_BrainpoolP192t1: M_ECName = 26;
pub const ECName_BrainpoolP224r1: M_ECName = 27;
pub const ECName_BrainpoolP224t1: M_ECName = 28;
pub const ECName_BrainpoolP256r1: M_ECName = 29;
pub const ECName_BrainpoolP256t1: M_ECName = 30;
pub const ECName_BrainpoolP320r1: M_ECName = 31;
pub const ECName_BrainpoolP320t1: M_ECName = 32;
pub const ECName_BrainpoolP384r1: M_ECName = 33;
pub const ECName_BrainpoolP384t1: M_ECName = 34;
pub const ECName_BrainpoolP512r1: M_ECName = 35;
pub const ECName_BrainpoolP512t1: M_ECName = 36;
pub const ECName__Max: M_ECName = 37;
pub type M_ECName = ::core::ffi::c_uint;
pub const FieldType_Prime: M_FieldType = 1;
pub const FieldType_Binary: M_FieldType = 2;
pub const FieldType_NISTfP192: M_FieldType = 3;
pub const FieldType_NISTfP224: M_FieldType = 4;
pub const FieldType_NISTfP256: M_FieldType = 5;
pub const FieldType_NISTfP384: M_FieldType = 6;
pub const FieldType_NISTfP521: M_FieldType = 7;
pub const FieldType_NISTfB163: M_FieldType = 8;
pub const FieldType_NISTfB233: M_FieldType = 9;
pub const FieldType_NISTfB283: M_FieldType = 10;
pub const FieldType_NISTfB409: M_FieldType = 11;
pub const FieldType_NISTfB571: M_FieldType = 12;
pub const FieldType_ANSIfB163: M_FieldType = 13;
pub const FieldType_ANSIfB191: M_FieldType = 14;
pub const FieldType_SECfP160: M_FieldType = 15;
pub const FieldType_SECP256k1: M_FieldType = 17;
pub const FieldType_BrainpoolP160: M_FieldType = 18;
pub const FieldType_BrainpoolP224: M_FieldType = 19;
pub const FieldType_BrainpoolP256: M_FieldType = 20;
pub const FieldType_BrainpoolP320: M_FieldType = 21;
pub const FieldType_BrainpoolP384: M_FieldType = 22;
pub const FieldType_BrainpoolP512: M_FieldType = 23;
pub const FieldType_BrainpoolP192: M_FieldType = 24;
pub const FieldType__Max: M_FieldType = 25;
pub type M_FieldType = ::core::ffi::c_uint;
pub const Mech_Any: M_Mech = 0;
pub const Mech_DESmCBCi64pPKCS5: M_Mech = 1;
pub const Mech_RSApPKCS1: M_Mech = 2;
pub const Mech_DESmECBpPKCS5: M_Mech = 7;
pub const Mech_DSA: M_Mech = 10;
pub const Mech_ArcFourpNONE: M_Mech = 11;
pub const Mech_DESmCBCMACi64pPKCS5: M_Mech = 17;
pub const Mech_CASTmCBCi64pPKCS5: M_Mech = 19;
pub const Mech_CASTmECBpPKCS5: M_Mech = 20;
pub const Mech_CASTmCBCMACi64pPKCS5: M_Mech = 21;
pub const Mech_DESmECBpNONE: M_Mech = 22;
pub const Mech_DESmCBCpNONE: M_Mech = 24;
pub const Mech_DHKeyExchange: M_Mech = 26;
pub const Mech_ElGamal: M_Mech = 27;
pub const Mech_CASTmECBpNONE: M_Mech = 29;
pub const Mech_CASTmCBCpNONE: M_Mech = 32;
pub const Mech_Generic64: M_Mech = 34;
pub const Mech_Generic64MAC: M_Mech = 35;
pub const Mech_DES3mCBCi64pPKCS5: M_Mech = 37;
pub const Mech_DES3mECBpPKCS5: M_Mech = 38;
pub const Mech_DES3mCBCMACi64pPKCS5: M_Mech = 39;
pub const Mech_DES3mECBpNONE: M_Mech = 40;
pub const Mech_DES3mCBCpNONE: M_Mech = 41;
pub const Mech_SHA1Hash: M_Mech = 44;
pub const Mech_MD5Hash: M_Mech = 45;
pub const Mech_RIPEMD160Hash: M_Mech = 52;
pub const Mech_HMACMD5: M_Mech = 54;
pub const Mech_HMACSHA1: M_Mech = 55;
pub const Mech_HMACRIPEMD160: M_Mech = 56;
pub const Mech_RSAhMD5pPKCS1: M_Mech = 58;
pub const Mech_RSAhSHA1pPKCS1: M_Mech = 59;
pub const Mech_RSAhRIPEMD160pPKCS1: M_Mech = 60;
pub const Mech_RSApPKCS1OAEP: M_Mech = 61;
pub const Mech_Generic128: M_Mech = 62;
pub const Mech_Generic128MAC: M_Mech = 63;
pub const Mech_Generic192: M_Mech = 64;
pub const Mech_Generic256: M_Mech = 66;
pub const Mech_SerpentmCBCi128pPKCS5: M_Mech = 68;
pub const Mech_SerpentmECBpPKCS5: M_Mech = 69;
pub const Mech_SerpentmCBCpNONE: M_Mech = 70;
pub const Mech_SerpentmECBpNONE: M_Mech = 71;
pub const Mech_SerpentmCBCMACi128pPKCS5: M_Mech = 72;
pub const Mech_RijndaelmCBCi128pPKCS5: M_Mech = 73;
pub const Mech_RijndaelmECBpPKCS5: M_Mech = 74;
pub const Mech_RijndaelmCBCpNONE: M_Mech = 75;
pub const Mech_RijndaelmECBpNONE: M_Mech = 76;
pub const Mech_RijndaelmCBCMACi128pPKCS5: M_Mech = 77;
pub const Mech_TwofishmCBCi128pPKCS5: M_Mech = 78;
pub const Mech_TwofishmECBpPKCS5: M_Mech = 79;
pub const Mech_TwofishmCBCpNONE: M_Mech = 80;
pub const Mech_TwofishmECBpNONE: M_Mech = 81;
pub const Mech_TwofishmCBCMACi128pPKCS5: M_Mech = 82;
pub const Mech_CAST256mCBCi128pPKCS5: M_Mech = 83;
pub const Mech_CAST256mECBpPKCS5: M_Mech = 84;
pub const Mech_CAST256mCBCpNONE: M_Mech = 85;
pub const Mech_CAST256mECBpNONE: M_Mech = 86;
pub const Mech_CAST256mCBCMACi128pPKCS5: M_Mech = 87;
pub const Mech_BlowfishmCBCi64pPKCS5: M_Mech = 88;
pub const Mech_BlowfishmECBpPKCS5: M_Mech = 89;
pub const Mech_BlowfishmCBCpNONE: M_Mech = 90;
pub const Mech_BlowfishmECBpNONE: M_Mech = 91;
pub const Mech_BlowfishmCBCMACi64pPKCS5: M_Mech = 92;
pub const Mech_SHA256Hash: M_Mech = 93;
pub const Mech_SHA384Hash: M_Mech = 94;
pub const Mech_SHA512Hash: M_Mech = 95;
pub const Mech_TigerHash: M_Mech = 96;
pub const Mech_HMACSHA256: M_Mech = 97;
pub const Mech_HMACSHA384: M_Mech = 98;
pub const Mech_HMACSHA512: M_Mech = 99;
pub const Mech_HMACTiger: M_Mech = 100;
pub const Mech_Imech: M_Mech = 101;
pub const Mech_DES3wSHA1: M_Mech = 102;
pub const Mech_DES3wCRC32: M_Mech = 103;
pub const Mech_HAS160Hash: M_Mech = 109;
pub const Mech_KCDSAHAS160: M_Mech = 110;
pub const Mech_KCDSASHA1: M_Mech = 111;
pub const Mech_KCDSARIPEMD160: M_Mech = 112;
pub const Mech_DES2mCBCi64pPKCS5: M_Mech = 113;
pub const Mech_DES2mCBCpNONE: M_Mech = 114;
pub const Mech_DES2mECBpPKCS5: M_Mech = 115;
pub const Mech_DES2mCBCMACi64pPKCS5: M_Mech = 116;
pub const Mech_DES2mECBpNONE: M_Mech = 117;
pub const Mech_RSApPKCS1pPKCS11: M_Mech = 118;
pub const Mech_SEEDmECBpNONE: M_Mech = 119;
pub const Mech_SEEDmECBpPKCS5: M_Mech = 120;
pub const Mech_SEEDmCBCpNONE: M_Mech = 121;
pub const Mech_SEEDmCBCi128pPKCS5: M_Mech = 122;
pub const Mech_SEEDmCBCMACi128pPKCS5: M_Mech = 123;
pub const Mech_DLIESe3DEShSHA1: M_Mech = 124;
pub const Mech_DLIESeAEShSHA1: M_Mech = 125;
pub const Mech_DESmCBCMACi0pPKCS5: M_Mech = 130;
pub const Mech_CASTmCBCMACi0pPKCS5: M_Mech = 131;
pub const Mech_DES3mCBCMACi0pPKCS5: M_Mech = 132;
pub const Mech_BlowfishmCBCMACi0pPKCS5: M_Mech = 134;
pub const Mech_DES2mCBCMACi0pPKCS5: M_Mech = 135;
pub const Mech_SerpentmCBCMACi0pPKCS5: M_Mech = 136;
pub const Mech_RijndaelmCBCMACi0pPKCS5: M_Mech = 137;
pub const Mech_TwofishmCBCMACi0pPKCS5: M_Mech = 138;
pub const Mech_CAST256mCBCMACi0pPKCS5: M_Mech = 139;
pub const Mech_SEEDmCBCMACi0pPKCS5: M_Mech = 140;
pub const Mech_BlobCryptv2kHasheRijndaelCBC0hSHA1mSHA1HMAC: M_Mech = 141;
pub const Mech_BlobCryptv2kRSAeRijndaelCBC0hSHA1mSHA1HMAC: M_Mech = 142;
pub const Mech_BlobCryptv2kDHeRijndaelCBC0hSHA1mSHA1HMAC: M_Mech = 143;
pub const Mech_BlobCrypt: M_Mech = 144;
pub const Mech_BlobCryptv2kHasheDES3CBC0hSHA1mSHA1HMAC: M_Mech = 145;
pub const Mech_BlobCryptv2kRSAeDES3CBC0hSHA1mSHA1HMAC: M_Mech = 146;
pub const Mech_BlobCryptv2kDHeDES3CBC0hSHA1mSHA1HMAC: M_Mech = 147;
pub const Mech_BlobCryptv2kHasheRijndaelCBC0hSHA256mSHA256HMAC: M_Mech = 148;
pub const Mech_BlobCryptv2kRSAeRijndaelCBC0hSHA256mSHA256HMAC: M_Mech = 149;
pub const Mech_BlobCryptv2kDHeRijndaelCBC0hSHA256mSHA256HMAC: M_Mech = 150;
pub const Mech_BlobCryptv2kHasheRijndaelCBC0hSHA512mSHA512HMAC: M_Mech = 151;
pub const Mech_BlobCryptv2kRSAeRijndaelCBC0hSHA512mSHA512HMAC: M_Mech = 152;
pub const Mech_BlobCryptv2kDHeRijndaelCBC0hSHA512mSHA512HMAC: M_Mech = 153;
pub const Mech_ECDSA: M_Mech = 154;
pub const Mech_ECDHKeyExchange: M_Mech = 155;
pub const Mech_DESmCBCMACi0pNONE: M_Mech = 156;
pub const Mech_DES2mCBCMACi0pNONE: M_Mech = 157;
pub const Mech_DES3mCBCMACi0pNONE: M_Mech = 158;
pub const Mech_RijndaelmCBCMACi0pNONE: M_Mech = 159;
pub const Mech_RSAhSHA1pPSS: M_Mech = 160;
pub const Mech_RSAhSHA256pPSS: M_Mech = 161;
pub const Mech_RSAhSHA384pPSS: M_Mech = 162;
pub const Mech_RSAhSHA512pPSS: M_Mech = 163;
pub const Mech_RSAhSHA256pPKCS1: M_Mech = 164;
pub const Mech_RSAhSHA384pPKCS1: M_Mech = 165;
pub const Mech_RSAhSHA512pPKCS1: M_Mech = 166;
pub const Mech_SHA224Hash: M_Mech = 167;
pub const Mech_HMACSHA224: M_Mech = 168;
pub const Mech_DSAhSHA224: M_Mech = 169;
pub const Mech_DSAhSHA256: M_Mech = 170;
pub const Mech_DSAhSHA384: M_Mech = 171;
pub const Mech_DSAhSHA512: M_Mech = 172;
pub const Mech_RSAhSHA224pPSS: M_Mech = 173;
pub const Mech_RSAhSHA224pPKCS1: M_Mech = 174;
pub const Mech_ARIAmCBCpNONE: M_Mech = 175;
pub const Mech_ARIAmECBpNONE: M_Mech = 176;
pub const Mech_RijndaelmCMAC: M_Mech = 177;
pub const Mech_GenericGCM128: M_Mech = 178;
pub const Mech_RijndaelmGCM: M_Mech = 179;
pub const Mech_KCDSASHA224: M_Mech = 180;
pub const Mech_KCDSASHA256: M_Mech = 181;
pub const Mech_ECDSAhSHA224: M_Mech = 184;
pub const Mech_ECDSAhSHA256: M_Mech = 185;
pub const Mech_ECDSAhSHA384: M_Mech = 186;
pub const Mech_ECDSAhSHA512: M_Mech = 187;
pub const Mech_CamelliamCBCpNONE: M_Mech = 188;
pub const Mech_CamelliamECBpNONE: M_Mech = 189;
pub const Mech_ECDHLaxKeyExchange: M_Mech = 190;
pub const Mech_RSAhRIPEMD160pPSS: M_Mech = 191;
pub const Mech_ECDSAhRIPEMD160: M_Mech = 192;
pub const Mech_DSAhRIPEMD160: M_Mech = 193;
pub const Mech_RSApPKCS1OAEPhSHA224: M_Mech = 195;
pub const Mech_RSApPKCS1OAEPhSHA256: M_Mech = 196;
pub const Mech_RSApPKCS1OAEPhSHA384: M_Mech = 197;
pub const Mech_RSApPKCS1OAEPhSHA512: M_Mech = 198;
pub const Mech_SEEDmCBCMACi0pNONE: M_Mech = 203;
pub const Mech_ECDSAhSHA256kGBCS: M_Mech = 204;
pub const Mech_SHA3b224Hash: M_Mech = 205;
pub const Mech_SHA3b256Hash: M_Mech = 206;
pub const Mech_SHA3b384Hash: M_Mech = 207;
pub const Mech_SHA3b512Hash: M_Mech = 208;
pub const Mech_Ed25519ph: M_Mech = 217;
pub const Mech_X25519KeyExchange: M_Mech = 218;
pub const Mech_Ed25519: M_Mech = 219;
pub const Mech_BlobCryptv3kNoneeAESCBC0dCTRCMACmSHA256HMAC: M_Mech = 222;
pub const Mech_BlobCryptv3kRSAOAEPeAESCBC0dCTRCMACmSHA256HMAC: M_Mech = 223;
pub const Mech_BlobCryptv3kNoneeAESCBC0dCTRCMACmSHA512HMAC: M_Mech = 224;
pub const Mech_BlobCryptv3kRSAOAEPeAESCBC0dCTRCMACmSHA512HMAC: M_Mech = 225;
pub const Mech_DHExKeyExchange: M_Mech = 226;
pub const Mech_DLIESeAEShSHA1DHEx: M_Mech = 227;
pub const Mech_AESKeyWrapPadded: M_Mech = 228;
pub const Mech_ECDHCKeyExchange: M_Mech = 229;
pub const Mech_AESmGCM: M_Mech = 232;
pub const Mech__Max: M_Mech = 233;
pub type M_Mech = ::core::ffi::c_uint;
pub const FileDevice_PhysToken: M_FileDevice = 1;
pub const FileDevice_NVMem: M_FileDevice = 2;
pub const FileDevice_NVMemPersist: M_FileDevice = 3;
pub const FileDevice__Max: M_FileDevice = 4;
pub type M_FileDevice = ::core::ffi::c_uint;
pub const BlobFormat_None: M_BlobFormat = 0;
pub const BlobFormat_Module: M_BlobFormat = 5;
pub const BlobFormat_Token: M_BlobFormat = 6;
pub const BlobFormat_Direct: M_BlobFormat = 7;
pub const BlobFormat_Indirect: M_BlobFormat = 8;
pub const BlobFormat_UserKey: M_BlobFormat = 9;
pub const BlobFormat__Max: M_BlobFormat = 10;
pub type M_BlobFormat = ::core::ffi::c_uint;
pub const DeriveMech_Any: M_DeriveMech = 0;
pub const DeriveMech_DESsplitXOR: M_DeriveMech = 1;
pub const DeriveMech_DESjoinXOR: M_DeriveMech = 2;
pub const DeriveMech_DES3splitXOR: M_DeriveMech = 3;
pub const DeriveMech_DES3joinXOR: M_DeriveMech = 4;
pub const DeriveMech_DESjoinXORsetParity: M_DeriveMech = 5;
pub const DeriveMech_DES3joinXORsetParity: M_DeriveMech = 6;
pub const DeriveMech_RandsplitXOR: M_DeriveMech = 7;
pub const DeriveMech_RandjoinXOR: M_DeriveMech = 8;
pub const DeriveMech_CASTsplitXOR: M_DeriveMech = 9;
pub const DeriveMech_CASTjoinXOR: M_DeriveMech = 10;
pub const DeriveMech_EncryptMarshalled: M_DeriveMech = 11;
pub const DeriveMech_DecryptMarshalled: M_DeriveMech = 12;
pub const DeriveMech_SSL3withRSA: M_DeriveMech = 13;
pub const DeriveMech_TLSwithRSA: M_DeriveMech = 14;
pub const DeriveMech_SSL3withDH: M_DeriveMech = 15;
pub const DeriveMech_TLSwithDH: M_DeriveMech = 16;
pub const DeriveMech_RawEncrypt: M_DeriveMech = 17;
pub const DeriveMech_RawDecrypt: M_DeriveMech = 18;
pub const DeriveMech_DES2splitXOR: M_DeriveMech = 19;
pub const DeriveMech_DES2joinXOR: M_DeriveMech = 20;
pub const DeriveMech_DES2joinXORsetParity: M_DeriveMech = 21;
pub const DeriveMech_PKCS8Encrypt: M_DeriveMech = 22;
pub const DeriveMech_PKCS8Decrypt: M_DeriveMech = 23;
pub const DeriveMech_RSAComponents: M_DeriveMech = 24;
pub const DeriveMech_KDPKeyWrapDES3: M_DeriveMech = 25;
pub const DeriveMech_AESsplitXOR: M_DeriveMech = 26;
pub const DeriveMech_AESjoinXOR: M_DeriveMech = 27;
pub const DeriveMech_SignedKDPKeyWrapDES3: M_DeriveMech = 28;
pub const DeriveMech_PublicFromPrivate: M_DeriveMech = 29;
pub const DeriveMech_ECCMQV: M_DeriveMech = 30;
pub const DeriveMech_ConcatenateBytes: M_DeriveMech = 31;
pub const DeriveMech_ConcatenationKDF: M_DeriveMech = 32;
pub const DeriveMech_NISTKDFmCTRpRijndaelCMACr32: M_DeriveMech = 33;
pub const DeriveMech_RawEncryptZeroPad: M_DeriveMech = 34;
pub const DeriveMech_RawDecryptZeroPad: M_DeriveMech = 35;
pub const DeriveMech_AESKeyWrap: M_DeriveMech = 36;
pub const DeriveMech_AESKeyUnwrap: M_DeriveMech = 37;
pub const DeriveMech_PKCS8DecryptEx: M_DeriveMech = 38;
pub const DeriveMech_CompositeWatchWordVerify: M_DeriveMech = 39;
pub const DeriveMech_CompositeWatchWordSign: M_DeriveMech = 40;
pub const DeriveMech_CompositeARQCVerify: M_DeriveMech = 41;
pub const DeriveMech_HyperledgerClient: M_DeriveMech = 43;
pub const DeriveMech_ECDHKA: M_DeriveMech = 46;
pub const DeriveMech_ECIESKeyWrap: M_DeriveMech = 47;
pub const DeriveMech_ECIESKeyUnwrap: M_DeriveMech = 48;
pub const DeriveMech_NISTKDFmCTRr8: M_DeriveMech = 49;
pub const DeriveMech_ECCMQVdNISTCKDF: M_DeriveMech = 50;
pub const DeriveMech_TUAKTOPC: M_DeriveMech = 51;
pub const DeriveMech_TUAKf1: M_DeriveMech = 52;
pub const DeriveMech_TUAKf1s: M_DeriveMech = 53;
pub const DeriveMech_TUAKf2345: M_DeriveMech = 54;
pub const DeriveMech_TUAKf5s: M_DeriveMech = 55;
pub const DeriveMech_DHKA: M_DeriveMech = 56;
pub const DeriveMech_X25519KA: M_DeriveMech = 57;
pub const DeriveMech_TestKX: M_DeriveMech = 58;
pub const DeriveMech_GenerateRSAB36: M_DeriveMech = 59;
pub const DeriveMech__Max: M_DeriveMech = 60;
pub type M_DeriveMech = ::core::ffi::c_uint;
pub const ARQCScheme_EMV2000: M_ARQCScheme = 1;
pub const ARQCScheme_EMV2004: M_ARQCScheme = 2;
pub const ARQCScheme_MCHIP21: M_ARQCScheme = 3;
pub const ARQCScheme_VIS10: M_ARQCScheme = 4;
pub const ARQCScheme_VIS10TDS: M_ARQCScheme = 5;
pub const ARQCScheme_MCHIP21TDS: M_ARQCScheme = 6;
pub const ARQCScheme_VIS18: M_ARQCScheme = 7;
pub const ARQCScheme_VIS18TDS: M_ARQCScheme = 8;
pub const ARQCScheme_VIS22: M_ARQCScheme = 9;
pub const ARQCScheme_VIS22TDS: M_ARQCScheme = 10;
pub const ARQCScheme__Max: M_ARQCScheme = 11;
pub type M_ARQCScheme = ::core::ffi::c_uint;
pub const KAPrimitive_Any: M_KAPrimitive = 0;
pub const KAPrimitive_ECDHdKDF2: M_KAPrimitive = 1;
pub const KAPrimitive_ECDHCdKDF2: M_KAPrimitive = 2;
pub const KAPrimitive_PKCS11LSB: M_KAPrimitive = 3;
pub const KAPrimitive_PKCS11MSB: M_KAPrimitive = 4;
pub const KAPrimitive__Max: M_KAPrimitive = 5;
pub type M_KAPrimitive = ::core::ffi::c_uint;
pub const IESCipherMode_Any: M_IESCipherMode = 0;
pub const IESCipherMode_XORwithHMAC: M_IESCipherMode = 1;
pub const IESCipherMode__Max: M_IESCipherMode = 2;
pub type M_IESCipherMode = ::core::ffi::c_uint;
pub const TestKXGroup_ImpathMODP3072: M_TestKXGroup = 1;
pub const TestKXGroup_SecureChannelv1: M_TestKXGroup = 2;
pub const TestKXGroup__Max: M_TestKXGroup = 3;
pub type M_TestKXGroup = ::core::ffi::c_uint;
pub const TestKXSessionKey_OutboundEncryption: M_TestKXSessionKey = 1;
pub const TestKXSessionKey_OutboundMAC: M_TestKXSessionKey = 2;
pub const TestKXSessionKey_InboundEncryption: M_TestKXSessionKey = 3;
pub const TestKXSessionKey_InboundMAC: M_TestKXSessionKey = 4;
pub const TestKXSessionKey__Max: M_TestKXSessionKey = 5;
pub type M_TestKXSessionKey = ::core::ffi::c_uint;
pub const RemoteServerOp_All: M_RemoteServerOp = 1;
pub const RemoteServerOp_ExportSlot: M_RemoteServerOp = 2;
pub const RemoteServerOp_ExportModule: M_RemoteServerOp = 3;
pub const RemoteServerOp_AccessFiles: M_RemoteServerOp = 4;
pub const RemoteServerOp__Max: M_RemoteServerOp = 5;
pub type M_RemoteServerOp = ::core::ffi::c_uint;
pub const ClientPermission_Unpriv: M_ClientPermission = 1;
pub const ClientPermission_Unix: M_ClientPermission = 2;
pub const ClientPermission_Wideopen: M_ClientPermission = 3;
pub const ClientPermission__Max: M_ClientPermission = 4;
pub type M_ClientPermission = ::core::ffi::c_uint;
pub const ModuleAttribTag_None: M_ModuleAttribTag = 0;
pub const ModuleAttribTag_Challenge: M_ModuleAttribTag = 1;
pub const ModuleAttribTag_ESN: M_ModuleAttribTag = 2;
pub const ModuleAttribTag_KML: M_ModuleAttribTag = 3;
pub const ModuleAttribTag_KLF: M_ModuleAttribTag = 4;
pub const ModuleAttribTag_KNSO: M_ModuleAttribTag = 5;
pub const ModuleAttribTag_KMList: M_ModuleAttribTag = 6;
pub const ModuleAttribTag_PhysSerial: M_ModuleAttribTag = 7;
pub const ModuleAttribTag_PhysFIPSl3: M_ModuleAttribTag = 8;
pub const ModuleAttribTag_FeatureGoldCert: M_ModuleAttribTag = 9;
pub const ModuleAttribTag_Enquiry: M_ModuleAttribTag = 10;
pub const ModuleAttribTag_AdditionalInfo: M_ModuleAttribTag = 11;
pub const ModuleAttribTag_ModKeyInfo: M_ModuleAttribTag = 12;
pub const ModuleAttribTag_KLF2: M_ModuleAttribTag = 13;
pub const ModuleAttribTag_KAL: M_ModuleAttribTag = 14;
pub const ModuleAttribTag_KLF3: M_ModuleAttribTag = 15;
pub const ModuleAttribTag_WarrantKLF2: M_ModuleAttribTag = 16;
pub const ModuleAttribTag_WarrantKLF3: M_ModuleAttribTag = 17;
pub const ModuleAttribTag__Max: M_ModuleAttribTag = 18;
pub type M_ModuleAttribTag = ::core::ffi::c_uint;
pub const ModuleType_None: M_ModuleType = 0;
pub const ModuleType_Clyde: M_ModuleType = 2;
pub const ModuleType_Chili: M_ModuleType = 4;
pub const ModuleType_Ariel: M_ModuleType = 5;
pub const ModuleType_Persil: M_ModuleType = 6;
pub const ModuleType_Dorris: M_ModuleType = 7;
pub const ModuleType_Morris: M_ModuleType = 8;
pub const ModuleType_SeaBird: M_ModuleType = 9;
pub const ModuleType_Cosmo: M_ModuleType = 10;
pub const ModuleType_Zowie: M_ModuleType = 11;
pub const ModuleType_Sawshark: M_ModuleType = 12;
pub const ModuleType_Emulator: M_ModuleType = 13;
pub const ModuleType_Ultra: M_ModuleType = 14;
pub const ModuleType_Unknown: M_ModuleType = 999;
pub const ModuleType_PoolModule: M_ModuleType = 1001;
pub const ModuleType__Max: M_ModuleType = 1002;
pub type M_ModuleType = ::core::ffi::c_uint;
pub const SEEMachineType_None: M_SEEMachineType = 0;
pub const SEEMachineType_gen1AIF: M_SEEMachineType = 1;
pub const SEEMachineType_PowerPCSXF: M_SEEMachineType = 2;
pub const SEEMachineType_Virtual: M_SEEMachineType = 3;
pub const SEEMachineType_ARMtype2: M_SEEMachineType = 4;
pub const SEEMachineType_PowerPCELF: M_SEEMachineType = 5;
pub const SEEMachineType__Max: M_SEEMachineType = 6;
pub type M_SEEMachineType = ::core::ffi::c_uint;
pub const FeatureGoldCertVendor_VeriSign: M_FeatureGoldCertVendor = 1;
pub const FeatureGoldCertVendor_InternalTestingOnly: M_FeatureGoldCertVendor = 2;
pub const FeatureGoldCertVendor__Max: M_FeatureGoldCertVendor = 3;
pub type M_FeatureGoldCertVendor = ::core::ffi::c_uint;
pub const Cmd_ErrorReturn: M_Cmd = 0;
pub const Cmd_ModExp: M_Cmd = 1;
pub const Cmd_ModExpCrt: M_Cmd = 2;
pub const Cmd_GeneratePrime: M_Cmd = 5;
pub const Cmd_GenerateRandom: M_Cmd = 8;
pub const Cmd_GenerateKey: M_Cmd = 9;
pub const Cmd_GenerateKeyPair: M_Cmd = 10;
pub const Cmd_Import: M_Cmd = 11;
pub const Cmd_Duplicate: M_Cmd = 12;
pub const Cmd_GetKeyInfo: M_Cmd = 13;
pub const Cmd_Destroy: M_Cmd = 14;
pub const Cmd_Encrypt: M_Cmd = 15;
pub const Cmd_Decrypt: M_Cmd = 16;
pub const Cmd_Verify: M_Cmd = 17;
pub const Cmd_Export: M_Cmd = 18;
pub const Cmd_GetAppData: M_Cmd = 19;
pub const Cmd_SetAppData: M_Cmd = 20;
pub const Cmd_NewClient: M_Cmd = 21;
pub const Cmd_ExistingClient: M_Cmd = 22;
pub const Cmd_GetWhichModule: M_Cmd = 23;
pub const Cmd_MergeKeyIDs: M_Cmd = 24;
pub const Cmd_GenerateLogicalToken: M_Cmd = 26;
pub const Cmd_WriteShare: M_Cmd = 27;
pub const Cmd_GetSlotList: M_Cmd = 28;
pub const Cmd_GetSlotInfo: M_Cmd = 29;
pub const Cmd_ReadShare: M_Cmd = 30;
pub const Cmd_LoadBlob: M_Cmd = 32;
pub const Cmd_LoadLogicalToken: M_Cmd = 34;
pub const Cmd_EraseShare: M_Cmd = 35;
pub const Cmd_ChangeSharePIN: M_Cmd = 36;
pub const Cmd_WriteFile: M_Cmd = 37;
pub const Cmd_ReadFile: M_Cmd = 38;
pub const Cmd_EraseFile: M_Cmd = 39;
pub const Cmd_ProgrammingBegin: M_Cmd = 40;
pub const Cmd_ProgrammingBeginChunk: M_Cmd = 41;
pub const Cmd_ProgrammingLoadBlock: M_Cmd = 42;
pub const Cmd_ProgrammingEndChunk: M_Cmd = 43;
pub const Cmd_ProgrammingEnd: M_Cmd = 44;
pub const Cmd_FormatToken: M_Cmd = 45;
pub const Cmd_SetKM: M_Cmd = 47;
pub const Cmd_RemoveKM: M_Cmd = 48;
pub const Cmd_GetKMList: M_Cmd = 49;
pub const Cmd_InitialiseUnit: M_Cmd = 50;
pub const Cmd_Maintenance: M_Cmd = 51;
pub const Cmd_Fail: M_Cmd = 52;
pub const Cmd_NewEnquiry: M_Cmd = 53;
pub const Cmd_NoOp: M_Cmd = 54;
pub const Cmd_Sign: M_Cmd = 55;
pub const Cmd_ModuleInfo: M_Cmd = 56;
pub const Cmd_ProgrammingGetKeyList: M_Cmd = 57;
pub const Cmd_InsertSoftToken: M_Cmd = 58;
pub const Cmd_RemoveSoftToken: M_Cmd = 59;
pub const Cmd_GetChallenge: M_Cmd = 60;
pub const Cmd_ANModuleReset: M_Cmd = 61;
pub const Cmd_MakeBlob: M_Cmd = 62;
pub const Cmd_GetLogicalTokenInfo: M_Cmd = 63;
pub const Cmd_GetKML: M_Cmd = 64;
pub const Cmd_ANReadTerminated: M_Cmd = 65;
pub const Cmd_ANPleaseClearUnitSoon: M_Cmd = 66;
pub const Cmd_ANPleaseClearUnitNow: M_Cmd = 67;
pub const Cmd_PauseForNotifications: M_Cmd = 68;
pub const Cmd_Hash: M_Cmd = 69;
pub const Cmd_ClearUnit: M_Cmd = 70;
pub const Cmd_ChannelOpen: M_Cmd = 71;
pub const Cmd_ChannelUpdate: M_Cmd = 72;
pub const Cmd_GetACL: M_Cmd = 73;
pub const Cmd_SetACL: M_Cmd = 74;
pub const Cmd_DeriveKey: M_Cmd = 75;
pub const Cmd_RetryFailedModule: M_Cmd = 76;
pub const Cmd_BignumOp: M_Cmd = 77;
pub const Cmd_RSAImmedSignDecrypt: M_Cmd = 78;
pub const Cmd_RSAImmedVerifyEncrypt: M_Cmd = 79;
pub const Cmd_StatEnumTree: M_Cmd = 80;
pub const Cmd_StatGetValues: M_Cmd = 81;
pub const Cmd_LoadRaw: M_Cmd = 87;
pub const Cmd_NVMemAlloc: M_Cmd = 88;
pub const Cmd_NVMemList: M_Cmd = 89;
pub const Cmd_NVMemOp: M_Cmd = 90;
pub const Cmd_NVMemFree: M_Cmd = 91;
pub const Cmd_GetRTC: M_Cmd = 92;
pub const Cmd_SetRTC: M_Cmd = 93;
pub const Cmd_CreateSEEWorld: M_Cmd = 94;
pub const Cmd_SEEJob: M_Cmd = 95;
pub const Cmd_CreateBuffer: M_Cmd = 96;
pub const Cmd_LoadBuffer: M_Cmd = 97;
pub const Cmd_SetSEEMachine: M_Cmd = 98;
pub const Cmd_TraceSEEWorld: M_Cmd = 99;
pub const Cmd_GetTicket: M_Cmd = 100;
pub const Cmd_RedeemTicket: M_Cmd = 101;
pub const Cmd_SetNSOPerms: M_Cmd = 102;
pub const Cmd_PollModuleState: M_Cmd = 103;
pub const Cmd_PollSlotList: M_Cmd = 104;
pub const Cmd_ANModuleChangeEvent: M_Cmd = 105;
pub const Cmd_ANSlotChangeEvent: M_Cmd = 106;
pub const Cmd_ImpathKXBegin: M_Cmd = 107;
pub const Cmd_ImpathKXFinish: M_Cmd = 108;
pub const Cmd_ImpathGetInfo: M_Cmd = 109;
pub const Cmd_ImpathSend: M_Cmd = 110;
pub const Cmd_ImpathReceive: M_Cmd = 111;
pub const Cmd_SendShare: M_Cmd = 112;
pub const Cmd_ReceiveShare: M_Cmd = 113;
pub const Cmd_ImportSlot: M_Cmd = 119;
pub const Cmd_UnimportSlot: M_Cmd = 120;
pub const Cmd_ExportSlot: M_Cmd = 121;
pub const Cmd_ServerSendShare: M_Cmd = 122;
pub const Cmd_GetClientHash: M_Cmd = 123;
pub const Cmd_UpdateMergedKey: M_Cmd = 124;
pub const Cmd_GetWorldSigners: M_Cmd = 125;
pub const Cmd_ForeignTokenOpen: M_Cmd = 126;
pub const Cmd_ForeignTokenCmd: M_Cmd = 127;
pub const Cmd_GetKeyInfoEx: M_Cmd = 129;
pub const Cmd_FirmwareAuthenticate: M_Cmd = 130;
pub const Cmd_SignModuleState: M_Cmd = 131;
pub const Cmd_GenerateKLF: M_Cmd = 132;
pub const Cmd_GetKLF: M_Cmd = 133;
pub const Cmd_AddRemoteServerPermission: M_Cmd = 134;
pub const Cmd_RemoveRemoteServerPermission: M_Cmd = 135;
pub const Cmd_ListRemoteServerPermission: M_Cmd = 136;
pub const Cmd_ANRemoteSlotDisconnected: M_Cmd = 137;
pub const Cmd_GetLogicalTokenInfoEx: M_Cmd = 138;
pub const Cmd_GetShareACL: M_Cmd = 139;
pub const Cmd_StaticFeatureEnable: M_Cmd = 140;
pub const Cmd_CheckUserAction: M_Cmd = 142;
pub const Cmd_FileCreate: M_Cmd = 143;
pub const Cmd_FileErase: M_Cmd = 144;
pub const Cmd_FileOp: M_Cmd = 145;
pub const Cmd_FileCopy: M_Cmd = 146;
pub const Cmd_ImportModule: M_Cmd = 147;
pub const Cmd_UnimportModule: M_Cmd = 148;
pub const Cmd_SetMaxNumClients: M_Cmd = 149;
pub const Cmd_ExportModule: M_Cmd = 150;
pub const Cmd_ANRemoteModuleDisconnected: M_Cmd = 151;
pub const Cmd_GetModuleState: M_Cmd = 152;
pub const Cmd_ServerNoOp: M_Cmd = 153;
pub const Cmd_FTSessionOpen: M_Cmd = 154;
pub const Cmd_FTStartRead: M_Cmd = 155;
pub const Cmd_FTRead: M_Cmd = 156;
pub const Cmd_FTStartWrite: M_Cmd = 157;
pub const Cmd_FTWrite: M_Cmd = 158;
pub const Cmd_FTStartListDir: M_Cmd = 159;
pub const Cmd_FTListDir: M_Cmd = 160;
pub const Cmd_SetPublishedObject: M_Cmd = 161;
pub const Cmd_RemovePublishedObject: M_Cmd = 162;
pub const Cmd_GetPublishedObject: M_Cmd = 163;
pub const Cmd_ReReadConfig: M_Cmd = 164;
pub const Cmd_RemoteSlots: M_Cmd = 165;
pub const Cmd_GetKnetiPub: M_Cmd = 166;
pub const Cmd_AnonymousKnetiHash: M_Cmd = 167;
pub const Cmd_IOBoardReprogram: M_Cmd = 169;
pub const Cmd_FTStat: M_Cmd = 173;
pub const Cmd_GetServerConfig: M_Cmd = 181;
pub const Cmd_QueryLongJobs: M_Cmd = 182;
pub const Cmd_FastSEEJob: M_Cmd = 183;
pub const Cmd_FTDelete: M_Cmd = 184;
pub const Cmd_FTChecksum: M_Cmd = 185;
pub const Cmd_FRAGMENT: M_Cmd = 186;
pub const Cmd_ProductionSetup: M_Cmd = 187;
pub const Cmd_MakeSEEWill: M_Cmd = 188;
pub const Cmd_ExecuteSEEWill: M_Cmd = 189;
pub const Cmd_ReadSoftTokenShare: M_Cmd = 194;
pub const Cmd_CreateClient: M_Cmd = 195;
pub const Cmd_InitialiseUnitEx: M_Cmd = 197;
pub const Cmd_GetMonitorLoaderState: M_Cmd = 198;
pub const Cmd_LoadMonitor: M_Cmd = 199;
pub const Cmd_ClearUnitEx: M_Cmd = 200;
pub const Cmd_VerifyCertificate: M_Cmd = 201;
pub const Cmd_DynamicSlotExchangeAPDUs: M_Cmd = 202;
pub const Cmd_StartUpdateWorld: M_Cmd = 204;
pub const Cmd_CheckWorld: M_Cmd = 205;
pub const Cmd_ReportWorldState: M_Cmd = 206;
pub const Cmd_DynamicSlotsConfigure: M_Cmd = 208;
pub const Cmd_ANSlotsConfigurationChangeEvent: M_Cmd = 209;
pub const Cmd_DynamicSlotCreateAssociation: M_Cmd = 210;
pub const Cmd_GetHardwareError: M_Cmd = 211;
pub const Cmd_DynamicSlotsConfigureQuery: M_Cmd = 212;
pub const Cmd_SetPrimarySlot: M_Cmd = 213;
pub const Cmd_ANLogEvent: M_Cmd = 214;
pub const Cmd_GetApplianceVersion: M_Cmd = 215;
pub const Cmd_RemoteReboot: M_Cmd = 216;
pub const Cmd_UpgradeApplianceFirmware: M_Cmd = 217;
pub const Cmd_SetApplianceUpgradeStatus: M_Cmd = 218;
pub const Cmd_GetApplianceUpgradeStatus: M_Cmd = 219;
pub const Cmd_FailDriver: M_Cmd = 223;
pub const Cmd_ConfigurePoolModule: M_Cmd = 224;
pub const Cmd_GetPoolInfo: M_Cmd = 226;
pub const Cmd_ApplyFeatureFile: M_Cmd = 231;
pub const Cmd_SendKey: M_Cmd = 232;
pub const Cmd_ReceiveKey: M_Cmd = 233;
pub const Cmd_ANSendAuditLogEvent: M_Cmd = 234;
pub const Cmd_EraseWorld: M_Cmd = 235;
pub const Cmd_GetApplianceTime: M_Cmd = 236;
pub const Cmd_SetApplianceTime: M_Cmd = 237;
pub const Cmd_GetKLF2: M_Cmd = 238;
pub const Cmd_ChangeShareGroupPIN: M_Cmd = 239;
pub const Cmd_HotReset: M_Cmd = 240;
pub const Cmd_DevTest: M_Cmd = 241;
pub const Cmd_ListRemoteServerPermissionEx: M_Cmd = 242;
pub const Cmd__Max: M_Cmd = 243;
pub type M_Cmd = ::core::ffi::c_uint;
pub const ModuleMode_Default: M_ModuleMode = 0;
pub const ModuleMode_Maintenance: M_ModuleMode = 1;
pub const ModuleMode_Operational: M_ModuleMode = 2;
pub const ModuleMode_Initialisation: M_ModuleMode = 3;
pub const ModuleMode__Max: M_ModuleMode = 4;
pub type M_ModuleMode = ::core::ffi::c_uint;
pub const CreateClientVer_Zero: M_CreateClientVer = 0;
pub const CreateClientVer_One: M_CreateClientVer = 1;
pub const CreateClientVer__Max: M_CreateClientVer = 2;
pub type M_CreateClientVer = ::core::ffi::c_uint;
pub const DevTestOp_GetFastRaw: M_DevTestOp = 0;
pub const DevTestOp_GetSlowRaw: M_DevTestOp = 1;
pub const DevTestOp__Max: M_DevTestOp = 2;
pub type M_DevTestOp = ::core::ffi::c_uint;
pub const NVMemOpType_Read: M_NVMemOpType = 1;
pub const NVMemOpType_Write: M_NVMemOpType = 2;
pub const NVMemOpType_Incr: M_NVMemOpType = 3;
pub const NVMemOpType_Decr: M_NVMemOpType = 4;
pub const NVMemOpType_BitSet: M_NVMemOpType = 5;
pub const NVMemOpType_BitClear: M_NVMemOpType = 6;
pub const NVMemOpType_Free: M_NVMemOpType = 7;
pub const NVMemOpType_IncrRead: M_NVMemOpType = 8;
pub const NVMemOpType_DecrRead: M_NVMemOpType = 9;
pub const NVMemOpType_BitSetRead: M_NVMemOpType = 10;
pub const NVMemOpType_BitClearRead: M_NVMemOpType = 11;
pub const NVMemOpType_GetACL: M_NVMemOpType = 12;
pub const NVMemOpType_Resize: M_NVMemOpType = 13;
pub const NVMemOpType__Max: M_NVMemOpType = 14;
pub type M_NVMemOpType = ::core::ffi::c_uint;
pub const FwAuthType_NFFHMAC1: M_FwAuthType = 1;
pub const FwAuthType_PRNG1: M_FwAuthType = 2;
pub const FwAuthType__Max: M_FwAuthType = 3;
pub type M_FwAuthType = ::core::ffi::c_uint;
pub const PhysTokenType_Invalid: M_PhysTokenType = 0;
pub const PhysTokenType_ISO7816: M_PhysTokenType = 1;
pub const PhysTokenType__Max: M_PhysTokenType = 2;
pub type M_PhysTokenType = ::core::ffi::c_uint;
pub const PoolInfo_StoreInfo: M_PoolInfo = 1;
pub const PoolInfo_ClientInfo: M_PoolInfo = 2;
pub const PoolInfo_ModuleInfo: M_PoolInfo = 3;
pub const PoolInfo_KeyInfo: M_PoolInfo = 4;
pub const PoolInfo__Max: M_PoolInfo = 5;
pub type M_PoolInfo = ::core::ffi::c_uint;
pub const TicketDestination_Any: M_TicketDestination = 0;
pub const TicketDestination_AnyClient: M_TicketDestination = 1;
pub const TicketDestination_NamedClient: M_TicketDestination = 2;
pub const TicketDestination_AnySEEWorld: M_TicketDestination = 3;
pub const TicketDestination_NamedSEEWorld: M_TicketDestination = 4;
pub const TicketDestination_AnyKernelClient: M_TicketDestination = 5;
pub const TicketDestination__Max: M_TicketDestination = 6;
pub type M_TicketDestination = ::core::ffi::c_uint;
pub const KMLType_DSAp1024s160: M_KMLType = 0;
pub const KMLType_DSAp3072s256: M_KMLType = 1;
pub const KMLType__Max: M_KMLType = 2;
pub type M_KMLType = ::core::ffi::c_uint;
pub const UpgradeState_Invalid: M_UpgradeState = 0;
pub const UpgradeState_Initiated: M_UpgradeState = 1;
pub const UpgradeState_Transferred: M_UpgradeState = 2;
pub const UpgradeState_Verified: M_UpgradeState = 3;
pub const UpgradeState_Upgraded: M_UpgradeState = 4;
pub const UpgradeState__Max: M_UpgradeState = 5;
pub type M_UpgradeState = ::core::ffi::c_uint;
pub const SignerType_KLF: M_SignerType = 1;
pub const SignerType_KML: M_SignerType = 2;
pub const SignerType_AppKey: M_SignerType = 3;
pub const SignerType_KLF2: M_SignerType = 4;
pub const SignerType__Max: M_SignerType = 5;
pub type M_SignerType = ::core::ffi::c_uint;
pub const CertificateKind_ModuleIdentification: M_CertificateKind = 1;
pub const CertificateKind__Max: M_CertificateKind = 2;
pub type M_CertificateKind = ::core::ffi::c_uint;
pub const StackOp_NoOp: M_StackOp = 0;
pub const StackOp_Add: M_StackOp = 1;
pub const StackOp_Sub: M_StackOp = 2;
pub const StackOp_RSub: M_StackOp = 3;
pub const StackOp_Mul: M_StackOp = 4;
pub const StackOp_Div: M_StackOp = 5;
pub const StackOp_Mod: M_StackOp = 6;
pub const StackOp_DivMod: M_StackOp = 7;
pub const StackOp_ModExp: M_StackOp = 8;
pub const StackOp_ModInv: M_StackOp = 9;
pub const StackOp_Dup: M_StackOp = 10;
pub const StackOp_Drop: M_StackOp = 11;
pub const StackOp_Rot: M_StackOp = 12;
pub const StackOp_Set: M_StackOp = 13;
pub const StackOp_Test: M_StackOp = 14;
pub const StackOp_TestPrime: M_StackOp = 15;
pub const StackOp_Neg: M_StackOp = 16;
pub const StackOp_Abs: M_StackOp = 17;
pub const StackOp_GCD: M_StackOp = 18;
pub const StackOp_LCM: M_StackOp = 19;
pub const StackOp__Max: M_StackOp = 20;
pub type M_StackOp = ::core::ffi::c_uint;
pub const ImpathWarrantType_KLF2: M_ImpathWarrantType = 1;
pub const ImpathWarrantType__Max: M_ImpathWarrantType = 2;
pub type M_ImpathWarrantType = ::core::ffi::c_uint;
pub const UseLim_Global: M_UseLim = 1;
pub const UseLim_AuthOld: M_UseLim = 2;
pub const UseLim_Time: M_UseLim = 3;
pub const UseLim_NonVolatile: M_UseLim = 4;
pub const UseLim_Auth: M_UseLim = 6;
pub const UseLim__Max: M_UseLim = 7;
pub type M_UseLim = ::core::ffi::c_uint;
pub const Act_NoAction: M_Act = 0;
pub const Act_OpPermissions: M_Act = 1;
pub const Act_MakeBlob: M_Act = 2;
pub const Act_MakeArchiveBlob: M_Act = 3;
pub const Act_NSOPermissions: M_Act = 4;
pub const Act_DeriveKey: M_Act = 5;
pub const Act_NVMemOpPerms: M_Act = 6;
pub const Act_FeatureEnable: M_Act = 7;
pub const Act_NVMemUseLimit: M_Act = 8;
pub const Act_SendShare: M_Act = 9;
pub const Act_ReadShare: M_Act = 10;
pub const Act_StaticFeatureEnable: M_Act = 11;
pub const Act_UserAction: M_Act = 12;
pub const Act_FileCopy: M_Act = 15;
pub const Act_DeriveKeyEx: M_Act = 47;
pub const Act_SendKey: M_Act = 48;
pub const Act__Max: M_Act = 49;
pub type M_Act = ::core::ffi::c_uint;
pub const DeriveRole_TemplateKey: M_DeriveRole = 0;
pub const DeriveRole_BaseKey: M_DeriveRole = 1;
pub const DeriveRole_WrapKey: M_DeriveRole = 2;
pub const DeriveRole_Key3: M_DeriveRole = 3;
pub const DeriveRole_Key4: M_DeriveRole = 4;
pub const DeriveRole_Key5: M_DeriveRole = 5;
pub const DeriveRole__Max: M_DeriveRole = 6;
pub type M_DeriveRole = ::core::ffi::c_uint;
pub const EnqVer_Zero: M_EnqVer = 0;
pub const EnqVer_One: M_EnqVer = 1;
pub const EnqVer_Two: M_EnqVer = 2;
pub const EnqVer_Three: M_EnqVer = 3;
pub const EnqVer_Four: M_EnqVer = 4;
pub const EnqVer_Five: M_EnqVer = 5;
pub const EnqVer_Six: M_EnqVer = 6;
pub const EnqVer__Max: M_EnqVer = 7;
pub type M_EnqVer = ::core::ffi::c_uint;
pub const LogTokenState_Present: M_LogTokenState = 1;
pub const LogTokenState_Reading: M_LogTokenState = 2;
pub const LogTokenState_Writing: M_LogTokenState = 3;
pub const LogTokenState_TokenAssemblyFailed: M_LogTokenState = 5;
pub const LogTokenState_PhysTokenNotPresent: M_LogTokenState = 6;
pub const LogTokenState_TimeLimitExceeded: M_LogTokenState = 7;
pub const LogTokenState__Max: M_LogTokenState = 8;
pub type M_LogTokenState = ::core::ffi::c_uint;
pub const MonitorLoaderState_Ready: M_MonitorLoaderState = 1;
pub const MonitorLoaderState_Finished: M_MonitorLoaderState = 2;
pub const MonitorLoaderState_AlreadyLoaded: M_MonitorLoaderState = 3;
pub const MonitorLoaderState__Max: M_MonitorLoaderState = 4;
pub type M_MonitorLoaderState = ::core::ffi::c_uint;
pub const ImpathState_Exchange: M_ImpathState = 1;
pub const ImpathState_UpAndRunning: M_ImpathState = 2;
pub const ImpathState_Expired: M_ImpathState = 3;
pub const ImpathState__Max: M_ImpathState = 4;
pub type M_ImpathState = ::core::ffi::c_uint;
pub const InfoFormat_HardwareRev1: M_InfoFormat = 1;
pub const InfoFormat_HardwareRev2: M_InfoFormat = 2;
pub const InfoFormat__Max: M_InfoFormat = 3;
pub type M_InfoFormat = ::core::ffi::c_uint;
pub const LogTokenShareState_OK: M_LogTokenShareState = 1;
pub const LogTokenShareState_NotYetWritten: M_LogTokenShareState = 2;
pub const LogTokenShareState_NotYetRead: M_LogTokenShareState = 3;
pub const LogTokenShareState__Max: M_LogTokenShareState = 4;
pub type M_LogTokenShareState = ::core::ffi::c_uint;
pub const BusType_SCSI: M_BusType = 0;
pub const BusType_PCI: M_BusType = 1;
pub const BusType_USB: M_BusType = 2;
pub const BusType_Local: M_BusType = 3;
pub const BusType_Serial: M_BusType = 4;
pub const BusType_I2C: M_BusType = 5;
pub const BusType_OneWire: M_BusType = 6;
pub const BusType_XBus: M_BusType = 7;
pub const BusType_PS2: M_BusType = 8;
pub const BusType__Max: M_BusType = 9;
pub type M_BusType = ::core::ffi::c_uint;
pub const StatID_Uptime: M_StatID = 1;
pub const StatID_CmdCount: M_StatID = 2;
pub const StatID_ReplyCount: M_StatID = 3;
pub const StatID_CmdBytes: M_StatID = 4;
pub const StatID_ReplyBytes: M_StatID = 5;
pub const StatID_CmdMarshalErrors: M_StatID = 6;
pub const StatID_ReplyMarshalErrors: M_StatID = 7;
pub const StatID_HostWriteCount: M_StatID = 8;
pub const StatID_HostWriteErrors: M_StatID = 9;
pub const StatID_HostWriteOverruns: M_StatID = 10;
pub const StatID_HostWriteNoMemory: M_StatID = 11;
pub const StatID_HostReadCount: M_StatID = 12;
pub const StatID_HostReadErrors: M_StatID = 13;
pub const StatID_HostReadEmpty: M_StatID = 14;
pub const StatID_HostReadUnderruns: M_StatID = 15;
pub const StatID_HostReadDeferred: M_StatID = 16;
pub const StatID_HostReadTerminated: M_StatID = 17;
pub const StatID_PFNIssued: M_StatID = 19;
pub const StatID_PFNRejected: M_StatID = 20;
pub const StatID_PFNCompleted: M_StatID = 21;
pub const StatID_ANIssued: M_StatID = 22;
pub const StatID_ChanJobsIssued: M_StatID = 23;
pub const StatID_ChanJobsCompleted: M_StatID = 24;
pub const StatID_CPULoadPercent: M_StatID = 25;
pub const StatID_HostIRQs: M_StatID = 26;
pub const StatID_ChanJobErrors: M_StatID = 27;
pub const StatID_HostDebugIRQs: M_StatID = 28;
pub const StatID_HostUnhandledIRQs: M_StatID = 29;
pub const StatID_HostReadReconnect: M_StatID = 30;
pub const StatID_SCSIConnections: M_StatID = 31;
pub const StatID_SCSICommands: M_StatID = 32;
pub const StatID_SCSIInquiries: M_StatID = 33;
pub const StatID_SCSIDisconnects: M_StatID = 34;
pub const StatID_SCSIReconnects: M_StatID = 35;
pub const StatID_SCSILUN0Use: M_StatID = 36;
pub const StatID_SCSILUN1Use: M_StatID = 37;
pub const StatID_SCSICmdErrors: M_StatID = 38;
pub const StatID_SCSIBusResets: M_StatID = 39;
pub const StatID_SCSICtrlErrors: M_StatID = 40;
pub const StatID_SCSITagQUse: M_StatID = 41;
pub const StatID_SCSIReconFailures: M_StatID = 42;
pub const StatID_HostWriteBadData: M_StatID = 43;
pub const StatID_ClientCount: M_StatID = 44;
pub const StatID_MaxClients: M_StatID = 45;
pub const StatID_QOutstanding: M_StatID = 46;
pub const StatID_DeviceFails: M_StatID = 47;
pub const StatID_DeviceRestarts: M_StatID = 48;
pub const StatID_DevOutstanding: M_StatID = 49;
pub const StatID_ObjectsCreated: M_StatID = 50;
pub const StatID_ObjectsDestroyed: M_StatID = 51;
pub const StatID_ObjectCount: M_StatID = 52;
pub const StatID_SCSIWideNeg: M_StatID = 53;
pub const StatID_SCSISyncNeg: M_StatID = 54;
pub const StatID_CurrentTempC: M_StatID = 55;
pub const StatID_MaxTempC: M_StatID = 56;
pub const StatID_MinTempC: M_StatID = 57;
pub const StatID_MemTotal: M_StatID = 58;
pub const StatID_MemAllocKernel: M_StatID = 59;
pub const StatID_MemAllocUser: M_StatID = 60;
pub const StatID_CurrentTemp2C: M_StatID = 61;
pub const StatID_MaxTemp2C: M_StatID = 62;
pub const StatID_MinTemp2C: M_StatID = 63;
pub const StatID_VoltageOn5VSupply: M_StatID = 64;
pub const StatID_VoltageOn12VSupply: M_StatID = 65;
pub const StatID_CurrentFanRPM: M_StatID = 66;
pub const StatID_CurrentFan2RPM: M_StatID = 67;
pub const StatID_CurrentFan3RPM: M_StatID = 68;
pub const StatID_CurrentFan4RPM: M_StatID = 69;
pub const StatID_CurrentFan5RPM: M_StatID = 70;
pub const StatID_CurrentFan6RPM: M_StatID = 71;
pub const StatID_HostKernReadCount: M_StatID = 72;
pub const StatID_HostKernReadDeferred: M_StatID = 73;
pub const StatID_HostKernReadReconnect: M_StatID = 74;
pub const StatID_HostKernReadErrors: M_StatID = 75;
pub const StatID_HostKernWriteCount: M_StatID = 76;
pub const StatID_HostKernWriteErrors: M_StatID = 77;
pub const StatID_HostReadPushedDMA: M_StatID = 78;
pub const StatID_HostReadPushedPIO: M_StatID = 79;
pub const StatID_HostKernReadPushedDMA: M_StatID = 80;
pub const StatID_HostKernReadPushedPIO: M_StatID = 81;
pub const StatID_RemoteIPAddr: M_StatID = 82;
pub const StatID_LongOutstanding: M_StatID = 83;
pub const StatID_CmdFragments: M_StatID = 84;
pub const StatID_ReplyFragments: M_StatID = 85;
pub const StatID_DriverIRQs: M_StatID = 86;
pub const StatID_DriverReadIRQs: M_StatID = 87;
pub const StatID_DriverWriteIRQs: M_StatID = 88;
pub const StatID_DriverWriteFails: M_StatID = 89;
pub const StatID_DriverWriteBlocks: M_StatID = 90;
pub const StatID_DriverWriteBytes: M_StatID = 91;
pub const StatID_DriverReadFails: M_StatID = 92;
pub const StatID_DriverReadBlocks: M_StatID = 93;
pub const StatID_DriverReadBytes: M_StatID = 94;
pub const StatID_DriverEnsureFail: M_StatID = 95;
pub const StatID_DriverEnsure: M_StatID = 96;
pub const StatID_JobsOutstanding: M_StatID = 97;
pub const StatID_LongJobsOutstanding: M_StatID = 98;
pub const StatID_VoltageOn3p3VSupply: M_StatID = 99;
pub const StatID_CurrentOn3p3VSupply: M_StatID = 100;
pub const StatID_TamperBattery1: M_StatID = 101;
pub const StatID_CurrentOn5VSupply: M_StatID = 102;
pub const StatID_TamperBattery2: M_StatID = 103;
pub const StatID_CurrentOn12VSupply: M_StatID = 104;
pub const StatID_VoltageOn5VSBSupply: M_StatID = 105;
pub const StatID_CurrentOn5VSBSupply: M_StatID = 106;
pub const StatID_PSUFailure: M_StatID = 107;
pub const StatID_ClientProcessID: M_StatID = 108;
pub const StatID_ClientProcessName: M_StatID = 109;
pub const StatID_ClientNumber: M_StatID = 110;
pub const StatID_ObjectCountTotal: M_StatID = 111;
pub const StatID_TempSP: M_StatID = 112;
pub const StatID_CurrentCPUTemp1: M_StatID = 113;
pub const StatID_CurrentCPUTemp2: M_StatID = 114;
pub const StatID_CurrentFanSpeed: M_StatID = 115;
pub const StatID_CurrentFanDuty: M_StatID = 116;
pub const StatID_CPUVoltage1: M_StatID = 117;
pub const StatID_CPUVoltage2: M_StatID = 118;
pub const StatID_CPUVoltage3: M_StatID = 119;
pub const StatID_CPUVoltage4: M_StatID = 120;
pub const StatID_CPUVoltage5: M_StatID = 121;
pub const StatID_CPUVoltage6: M_StatID = 122;
pub const StatID_CPUVoltage7: M_StatID = 123;
pub const StatID_CPUVoltage8: M_StatID = 124;
pub const StatID_CPUVoltage9: M_StatID = 125;
pub const StatID_CPUVoltage10: M_StatID = 127;
pub const StatID_CPUVoltage11: M_StatID = 128;
pub const StatID_CacheEntryCount: M_StatID = 129;
pub const StatID_CacheEntriesInserted: M_StatID = 130;
pub const StatID_CacheEntriesRemoved: M_StatID = 131;
pub const StatID_AIS31PrelimAlarms: M_StatID = 132;
pub const StatID_MceCount: M_StatID = 133;
pub const StatID_SpiRetries: M_StatID = 134;
pub const StatID_SpI2c1: M_StatID = 135;
pub const StatID_SpI2c2: M_StatID = 136;
pub const StatID_SpTempExcursion: M_StatID = 137;
pub const StatID_SpVoltageExcursion: M_StatID = 138;
pub const StatID_HostBusExceptions: M_StatID = 139;
pub const StatID_CryptoBusExceptions: M_StatID = 140;
pub const StatID_SerialNumber: M_StatID = 141;
pub const StatID_CurrentTime: M_StatID = 142;
pub const StatID_XCSpLogEventID: M_StatID = 143;
pub const StatID_XCSpLogEventDate: M_StatID = 144;
pub const StatID_SpSensorCmdFails: M_StatID = 145;
pub const StatID_JobsStarted: M_StatID = 146;
pub const StatID_JobsComplete: M_StatID = 147;
pub const StatID_RepliesQueued: M_StatID = 148;
pub const StatID_ReservedMax: M_StatID = 1000;
pub const StatID__Max: M_StatID = 1001;
pub type M_StatID = ::core::ffi::c_uint;
pub const SEEInitStatus_OK: M_SEEInitStatus = 0;
pub const SEEInitStatus_MachineFailed: M_SEEInitStatus = 1;
pub const SEEInitStatus__Max: M_SEEInitStatus = 2;
pub type M_SEEInitStatus = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Hash {
    pub bytes: [::core::ffi::c_uchar; 20usize],
    pub words: [M_Word; 5usize],
}
#[test]
fn bindgen_test_layout_M_Hash() {
    const UNINIT: ::core::mem::MaybeUninit<M_Hash> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Hash>(),
        20usize,
        concat!("Size of: ", stringify!(M_Hash))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Hash>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Hash))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Hash {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Hash {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Hash {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Hash28 {
    pub bytes: [::core::ffi::c_uchar; 28usize],
    pub words: [M_Word; 7usize],
}
#[test]
fn bindgen_test_layout_M_Hash28() {
    const UNINIT: ::core::mem::MaybeUninit<M_Hash28> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Hash28>(),
        28usize,
        concat!("Size of: ", stringify!(M_Hash28))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Hash28>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Hash28))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash28),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash28),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Hash28 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Hash28 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Hash28 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Hash32 {
    pub bytes: [::core::ffi::c_uchar; 32usize],
    pub words: [M_Word; 8usize],
}
#[test]
fn bindgen_test_layout_M_Hash32() {
    const UNINIT: ::core::mem::MaybeUninit<M_Hash32> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Hash32>(),
        32usize,
        concat!("Size of: ", stringify!(M_Hash32))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Hash32>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Hash32))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash32),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash32),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Hash32 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Hash32 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Hash32 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Hash48 {
    pub bytes: [::core::ffi::c_uchar; 48usize],
    pub words: [M_Word; 12usize],
}
#[test]
fn bindgen_test_layout_M_Hash48() {
    const UNINIT: ::core::mem::MaybeUninit<M_Hash48> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Hash48>(),
        48usize,
        concat!("Size of: ", stringify!(M_Hash48))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Hash48>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Hash48))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash48),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash48),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Hash48 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Hash48 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Hash48 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Hash64 {
    pub bytes: [::core::ffi::c_uchar; 64usize],
    pub words: [M_Word; 16usize],
}
#[test]
fn bindgen_test_layout_M_Hash64() {
    const UNINIT: ::core::mem::MaybeUninit<M_Hash64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Hash64>(),
        64usize,
        concat!("Size of: ", stringify!(M_Hash64))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Hash64>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Hash64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash64),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash64),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Hash64 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Hash64 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Hash64 {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct M_Status_AttemptedDowngrade_ErrorInfo {
    pub oldvsn: M_Word,
    pub newvsn: M_Word,
}
#[test]
fn bindgen_test_layout_M_Status_AttemptedDowngrade_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_AttemptedDowngrade_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_AttemptedDowngrade_ErrorInfo>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(M_Status_AttemptedDowngrade_ErrorInfo)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_AttemptedDowngrade_ErrorInfo>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_Status_AttemptedDowngrade_ErrorInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).oldvsn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_AttemptedDowngrade_ErrorInfo),
            "::",
            stringify!(oldvsn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).newvsn) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_AttemptedDowngrade_ErrorInfo),
            "::",
            stringify!(newvsn)
        )
    );
}
pub type M_vec_CrossModuleReason = *mut M_CrossModuleReason;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Status_CrossModule_ErrorInfo {
    pub n_reasons: ::core::ffi::c_int,
    pub reasons: M_vec_CrossModuleReason,
}
#[test]
fn bindgen_test_layout_M_Status_CrossModule_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_CrossModule_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_CrossModule_ErrorInfo>(),
        16usize,
        concat!("Size of: ", stringify!(M_Status_CrossModule_ErrorInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_CrossModule_ErrorInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Status_CrossModule_ErrorInfo))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_reasons) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_CrossModule_ErrorInfo),
            "::",
            stringify!(n_reasons)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reasons) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_CrossModule_ErrorInfo),
            "::",
            stringify!(reasons)
        )
    );
}
impl Default for M_Status_CrossModule_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_Status_RemoteServerFailed_ErrorInfo_flags = M_Word;
pub type M_opt_StatusErrorInfo = *mut M_StatusErrorInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Status_RemoteServerFailed_ErrorInfo {
    pub flags: M_Status_RemoteServerFailed_ErrorInfo_flags,
    pub stinfo: M_opt_StatusErrorInfo,
    pub addr: *mut M_NetworkAddress,
}
#[test]
fn bindgen_test_layout_M_Status_RemoteServerFailed_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_RemoteServerFailed_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_RemoteServerFailed_ErrorInfo>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(M_Status_RemoteServerFailed_ErrorInfo)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_RemoteServerFailed_ErrorInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_Status_RemoteServerFailed_ErrorInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_RemoteServerFailed_ErrorInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_RemoteServerFailed_ErrorInfo),
            "::",
            stringify!(stinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_RemoteServerFailed_ErrorInfo),
            "::",
            stringify!(addr)
        )
    );
}
impl Default for M_Status_RemoteServerFailed_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Status_SlotUnconnected_ErrorInfo {
    pub stinfo: M_opt_StatusErrorInfo,
}
#[test]
fn bindgen_test_layout_M_Status_SlotUnconnected_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_SlotUnconnected_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_SlotUnconnected_ErrorInfo>(),
        8usize,
        concat!("Size of: ", stringify!(M_Status_SlotUnconnected_ErrorInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_SlotUnconnected_ErrorInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_Status_SlotUnconnected_ErrorInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_SlotUnconnected_ErrorInfo),
            "::",
            stringify!(stinfo)
        )
    );
}
impl Default for M_Status_SlotUnconnected_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Status_TokenTransactionCorrupted_ErrorInfo {
    pub tokenstatus: M_Status,
}
#[test]
fn bindgen_test_layout_M_Status_TokenTransactionCorrupted_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_TokenTransactionCorrupted_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_TokenTransactionCorrupted_ErrorInfo>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(M_Status_TokenTransactionCorrupted_ErrorInfo)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_TokenTransactionCorrupted_ErrorInfo>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_Status_TokenTransactionCorrupted_ErrorInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tokenstatus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_TokenTransactionCorrupted_ErrorInfo),
            "::",
            stringify!(tokenstatus)
        )
    );
}
impl Default for M_Status_TokenTransactionCorrupted_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Status_TokenTransactionRolledBack_ErrorInfo {
    pub tokenstatus: M_Status,
}
#[test]
fn bindgen_test_layout_M_Status_TokenTransactionRolledBack_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_TokenTransactionRolledBack_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_TokenTransactionRolledBack_ErrorInfo>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(M_Status_TokenTransactionRolledBack_ErrorInfo)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_TokenTransactionRolledBack_ErrorInfo>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_Status_TokenTransactionRolledBack_ErrorInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tokenstatus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_TokenTransactionRolledBack_ErrorInfo),
            "::",
            stringify!(tokenstatus)
        )
    );
}
impl Default for M_Status_TokenTransactionRolledBack_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Status_UnknownKPSName_ErrorInfo {
    pub knownkps: M_ASCIIString,
}
#[test]
fn bindgen_test_layout_M_Status_UnknownKPSName_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_UnknownKPSName_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_UnknownKPSName_ErrorInfo>(),
        8usize,
        concat!("Size of: ", stringify!(M_Status_UnknownKPSName_ErrorInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_UnknownKPSName_ErrorInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_Status_UnknownKPSName_ErrorInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).knownkps) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_UnknownKPSName_ErrorInfo),
            "::",
            stringify!(knownkps)
        )
    );
}
impl Default for M_Status_UnknownKPSName_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KeyHash = M_Hash;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Status_UnknownKeyHash_ErrorInfo {
    pub hk: M_KeyHash,
}
#[test]
fn bindgen_test_layout_M_Status_UnknownKeyHash_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_UnknownKeyHash_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_UnknownKeyHash_ErrorInfo>(),
        20usize,
        concat!("Size of: ", stringify!(M_Status_UnknownKeyHash_ErrorInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_UnknownKeyHash_ErrorInfo>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_Status_UnknownKeyHash_ErrorInfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hk) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_UnknownKeyHash_ErrorInfo),
            "::",
            stringify!(hk)
        )
    );
}
impl Default for M_Status_UnknownKeyHash_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Status_UnknownKeyHash_ErrorInfo {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_Status_UnknownKeyHash_ErrorInfo {{ hk: {:?} }}",
            self.hk
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Status_nCErrno_ErrorInfo {
    pub err: M_nCErrno,
    pub strerr: M_ASCIIString,
}
#[test]
fn bindgen_test_layout_M_Status_nCErrno_ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status_nCErrno_ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status_nCErrno_ErrorInfo>(),
        16usize,
        concat!("Size of: ", stringify!(M_Status_nCErrno_ErrorInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status_nCErrno_ErrorInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Status_nCErrno_ErrorInfo))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).err) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_nCErrno_ErrorInfo),
            "::",
            stringify!(err)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).strerr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status_nCErrno_ErrorInfo),
            "::",
            stringify!(strerr)
        )
    );
}
impl Default for M_Status_nCErrno_ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Status__ErrorInfo {
    pub attempteddowngrade: M_Status_AttemptedDowngrade_ErrorInfo,
    pub crossmodule: M_Status_CrossModule_ErrorInfo,
    pub remoteserverfailed: M_Status_RemoteServerFailed_ErrorInfo,
    pub slotunconnected: M_Status_SlotUnconnected_ErrorInfo,
    pub tokentransactioncorrupted: M_Status_TokenTransactionCorrupted_ErrorInfo,
    pub tokentransactionrolledback: M_Status_TokenTransactionRolledBack_ErrorInfo,
    pub unknownkpsname: M_Status_UnknownKPSName_ErrorInfo,
    pub unknownkeyhash: M_Status_UnknownKeyHash_ErrorInfo,
    pub ncerrno: M_Status_nCErrno_ErrorInfo,
}
#[test]
fn bindgen_test_layout_M_Status__ErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_Status__ErrorInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Status__ErrorInfo>(),
        24usize,
        concat!("Size of: ", stringify!(M_Status__ErrorInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Status__ErrorInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Status__ErrorInfo))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attempteddowngrade) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(attempteddowngrade)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).crossmodule) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(crossmodule)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remoteserverfailed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(remoteserverfailed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).slotunconnected) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(slotunconnected)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tokentransactioncorrupted) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(tokentransactioncorrupted)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tokentransactionrolledback) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(tokentransactionrolledback)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unknownkpsname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(unknownkpsname)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unknownkeyhash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(unknownkeyhash)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ncerrno) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Status__ErrorInfo),
            "::",
            stringify!(ncerrno)
        )
    );
}
impl Default for M_Status__ErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Status__ErrorInfo {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Status__ErrorInfo {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct M_CrossModReason_Key_Info {
    pub key: M_KeyID,
}
#[test]
fn bindgen_test_layout_M_CrossModReason_Key_Info() {
    const UNINIT: ::core::mem::MaybeUninit<M_CrossModReason_Key_Info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_CrossModReason_Key_Info>(),
        4usize,
        concat!("Size of: ", stringify!(M_CrossModReason_Key_Info))
    );
    assert_eq!(
        ::core::mem::align_of::<M_CrossModReason_Key_Info>(),
        4usize,
        concat!("Alignment of ", stringify!(M_CrossModReason_Key_Info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_CrossModReason_Key_Info),
            "::",
            stringify!(key)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_CrossModReason__Info {
    pub key: M_CrossModReason_Key_Info,
}
#[test]
fn bindgen_test_layout_M_CrossModReason__Info() {
    const UNINIT: ::core::mem::MaybeUninit<M_CrossModReason__Info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_CrossModReason__Info>(),
        4usize,
        concat!("Size of: ", stringify!(M_CrossModReason__Info))
    );
    assert_eq!(
        ::core::mem::align_of::<M_CrossModReason__Info>(),
        4usize,
        concat!("Alignment of ", stringify!(M_CrossModReason__Info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_CrossModReason__Info),
            "::",
            stringify!(key)
        )
    );
}
impl Default for M_CrossModReason__Info {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_CrossModReason__Info {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_CrossModReason__Info {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_CrossModuleReason {
    pub type_: M_CrossModReason,
    pub info: M_CrossModReason__Info,
}
#[test]
fn bindgen_test_layout_M_CrossModuleReason() {
    const UNINIT: ::core::mem::MaybeUninit<M_CrossModuleReason> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_CrossModuleReason>(),
        8usize,
        concat!("Size of: ", stringify!(M_CrossModuleReason))
    );
    assert_eq!(
        ::core::mem::align_of::<M_CrossModuleReason>(),
        4usize,
        concat!("Alignment of ", stringify!(M_CrossModuleReason))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_CrossModuleReason),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_CrossModuleReason),
            "::",
            stringify!(info)
        )
    );
}
impl Default for M_CrossModuleReason {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_CrossModuleReason {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_CrossModuleReason {{ type: {:?}, info: {:?} }}",
            self.type_, self.info
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_StatusErrorInfo {
    pub st: M_Status,
    pub einfo: M_Status__ErrorInfo,
}
#[test]
fn bindgen_test_layout_M_StatusErrorInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_StatusErrorInfo> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_StatusErrorInfo>(),
        32usize,
        concat!("Size of: ", stringify!(M_StatusErrorInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_StatusErrorInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(M_StatusErrorInfo))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_StatusErrorInfo),
            "::",
            stringify!(st)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).einfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_StatusErrorInfo),
            "::",
            stringify!(einfo)
        )
    );
}
impl Default for M_StatusErrorInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_StatusErrorInfo {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_StatusErrorInfo {{ st: {:?}, einfo: {:?} }}",
            self.st, self.einfo
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_NetworkAddressFamily_HOST_Value {
    pub addr: M_ASCIIString,
    pub port: M_Word,
}
#[test]
fn bindgen_test_layout_M_NetworkAddressFamily_HOST_Value() {
    const UNINIT: ::core::mem::MaybeUninit<M_NetworkAddressFamily_HOST_Value> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_NetworkAddressFamily_HOST_Value>(),
        16usize,
        concat!("Size of: ", stringify!(M_NetworkAddressFamily_HOST_Value))
    );
    assert_eq!(
        ::core::mem::align_of::<M_NetworkAddressFamily_HOST_Value>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_NetworkAddressFamily_HOST_Value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily_HOST_Value),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily_HOST_Value),
            "::",
            stringify!(port)
        )
    );
}
impl Default for M_NetworkAddressFamily_HOST_Value {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_IPv4Address {
    pub bytes: [::core::ffi::c_uchar; 4usize],
    pub words: [M_Word; 1usize],
}
#[test]
fn bindgen_test_layout_M_IPv4Address() {
    const UNINIT: ::core::mem::MaybeUninit<M_IPv4Address> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_IPv4Address>(),
        4usize,
        concat!("Size of: ", stringify!(M_IPv4Address))
    );
    assert_eq!(
        ::core::mem::align_of::<M_IPv4Address>(),
        4usize,
        concat!("Alignment of ", stringify!(M_IPv4Address))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_IPv4Address),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_IPv4Address),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_IPv4Address {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_IPv4Address {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_IPv4Address {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_NetworkAddressFamily_INET_Value {
    pub addr: M_IPv4Address,
    pub port: M_Word,
}
#[test]
fn bindgen_test_layout_M_NetworkAddressFamily_INET_Value() {
    const UNINIT: ::core::mem::MaybeUninit<M_NetworkAddressFamily_INET_Value> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_NetworkAddressFamily_INET_Value>(),
        8usize,
        concat!("Size of: ", stringify!(M_NetworkAddressFamily_INET_Value))
    );
    assert_eq!(
        ::core::mem::align_of::<M_NetworkAddressFamily_INET_Value>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_NetworkAddressFamily_INET_Value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily_INET_Value),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily_INET_Value),
            "::",
            stringify!(port)
        )
    );
}
impl Default for M_NetworkAddressFamily_INET_Value {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_NetworkAddressFamily_INET_Value {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_NetworkAddressFamily_INET_Value {{ addr: {:?}, port: {:?} }}",
            self.addr, self.port
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_IPv6Address {
    pub bytes: [::core::ffi::c_uchar; 16usize],
    pub words: [M_Word; 4usize],
}
#[test]
fn bindgen_test_layout_M_IPv6Address() {
    const UNINIT: ::core::mem::MaybeUninit<M_IPv6Address> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_IPv6Address>(),
        16usize,
        concat!("Size of: ", stringify!(M_IPv6Address))
    );
    assert_eq!(
        ::core::mem::align_of::<M_IPv6Address>(),
        4usize,
        concat!("Alignment of ", stringify!(M_IPv6Address))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_IPv6Address),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_IPv6Address),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_IPv6Address {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_IPv6Address {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_IPv6Address {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_NetworkAddressFamily_INET6_Value {
    pub addr: M_IPv6Address,
    pub port: M_Word,
}
#[test]
fn bindgen_test_layout_M_NetworkAddressFamily_INET6_Value() {
    const UNINIT: ::core::mem::MaybeUninit<M_NetworkAddressFamily_INET6_Value> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_NetworkAddressFamily_INET6_Value>(),
        20usize,
        concat!("Size of: ", stringify!(M_NetworkAddressFamily_INET6_Value))
    );
    assert_eq!(
        ::core::mem::align_of::<M_NetworkAddressFamily_INET6_Value>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_NetworkAddressFamily_INET6_Value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily_INET6_Value),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily_INET6_Value),
            "::",
            stringify!(port)
        )
    );
}
impl Default for M_NetworkAddressFamily_INET6_Value {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_NetworkAddressFamily_INET6_Value {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_NetworkAddressFamily_INET6_Value {{ addr: {:?}, port: {:?} }}",
            self.addr, self.port
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_NetworkAddressFamily__Value {
    pub host: M_NetworkAddressFamily_HOST_Value,
    pub inet: M_NetworkAddressFamily_INET_Value,
    pub inet6: M_NetworkAddressFamily_INET6_Value,
}
#[test]
fn bindgen_test_layout_M_NetworkAddressFamily__Value() {
    const UNINIT: ::core::mem::MaybeUninit<M_NetworkAddressFamily__Value> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_NetworkAddressFamily__Value>(),
        24usize,
        concat!("Size of: ", stringify!(M_NetworkAddressFamily__Value))
    );
    assert_eq!(
        ::core::mem::align_of::<M_NetworkAddressFamily__Value>(),
        8usize,
        concat!("Alignment of ", stringify!(M_NetworkAddressFamily__Value))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily__Value),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).inet) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily__Value),
            "::",
            stringify!(inet)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).inet6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddressFamily__Value),
            "::",
            stringify!(inet6)
        )
    );
}
impl Default for M_NetworkAddressFamily__Value {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_NetworkAddressFamily__Value {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_NetworkAddressFamily__Value {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_NetworkAddress {
    pub af: M_NetworkAddressFamily,
    pub addr: M_NetworkAddressFamily__Value,
}
#[test]
fn bindgen_test_layout_M_NetworkAddress() {
    const UNINIT: ::core::mem::MaybeUninit<M_NetworkAddress> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_NetworkAddress>(),
        32usize,
        concat!("Size of: ", stringify!(M_NetworkAddress))
    );
    assert_eq!(
        ::core::mem::align_of::<M_NetworkAddress>(),
        8usize,
        concat!("Alignment of ", stringify!(M_NetworkAddress))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).af) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddress),
            "::",
            stringify!(af)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_NetworkAddress),
            "::",
            stringify!(addr)
        )
    );
}
impl Default for M_NetworkAddress {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_NetworkAddress {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_NetworkAddress {{ af: {:?}, addr: {:?} }}",
            self.af, self.addr
        )
    }
}
pub type M_ClientID = M_Hash;
pub type M_LimitID = M_Hash;
pub type M_Hash20 = M_Hash;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyHashMech_SHA1Hash_KeyHashData {
    pub hash: M_Hash20,
}
#[test]
fn bindgen_test_layout_M_KeyHashMech_SHA1Hash_KeyHashData() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyHashMech_SHA1Hash_KeyHashData> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyHashMech_SHA1Hash_KeyHashData>(),
        20usize,
        concat!("Size of: ", stringify!(M_KeyHashMech_SHA1Hash_KeyHashData))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyHashMech_SHA1Hash_KeyHashData>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_KeyHashMech_SHA1Hash_KeyHashData)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashMech_SHA1Hash_KeyHashData),
            "::",
            stringify!(hash)
        )
    );
}
impl Default for M_KeyHashMech_SHA1Hash_KeyHashData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyHashMech_SHA1Hash_KeyHashData {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyHashMech_SHA1Hash_KeyHashData {{ hash: {:?} }}",
            self.hash
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyHashMech_SHA256Hash_KeyHashData {
    pub hash: M_Hash32,
}
#[test]
fn bindgen_test_layout_M_KeyHashMech_SHA256Hash_KeyHashData() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyHashMech_SHA256Hash_KeyHashData> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyHashMech_SHA256Hash_KeyHashData>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(M_KeyHashMech_SHA256Hash_KeyHashData)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyHashMech_SHA256Hash_KeyHashData>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_KeyHashMech_SHA256Hash_KeyHashData)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashMech_SHA256Hash_KeyHashData),
            "::",
            stringify!(hash)
        )
    );
}
impl Default for M_KeyHashMech_SHA256Hash_KeyHashData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyHashMech_SHA256Hash_KeyHashData {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyHashMech_SHA256Hash_KeyHashData {{ hash: {:?} }}",
            self.hash
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyHashMech_SHA512Hash_KeyHashData {
    pub hash: M_Hash64,
}
#[test]
fn bindgen_test_layout_M_KeyHashMech_SHA512Hash_KeyHashData() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyHashMech_SHA512Hash_KeyHashData> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyHashMech_SHA512Hash_KeyHashData>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(M_KeyHashMech_SHA512Hash_KeyHashData)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyHashMech_SHA512Hash_KeyHashData>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(M_KeyHashMech_SHA512Hash_KeyHashData)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashMech_SHA512Hash_KeyHashData),
            "::",
            stringify!(hash)
        )
    );
}
impl Default for M_KeyHashMech_SHA512Hash_KeyHashData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyHashMech_SHA512Hash_KeyHashData {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyHashMech_SHA512Hash_KeyHashData {{ hash: {:?} }}",
            self.hash
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_KeyHashMech__KeyHashData {
    pub sha1hash: M_KeyHashMech_SHA1Hash_KeyHashData,
    pub sha256hash: M_KeyHashMech_SHA256Hash_KeyHashData,
    pub sha512hash: M_KeyHashMech_SHA512Hash_KeyHashData,
}
#[test]
fn bindgen_test_layout_M_KeyHashMech__KeyHashData() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyHashMech__KeyHashData> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyHashMech__KeyHashData>(),
        64usize,
        concat!("Size of: ", stringify!(M_KeyHashMech__KeyHashData))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyHashMech__KeyHashData>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyHashMech__KeyHashData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sha1hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashMech__KeyHashData),
            "::",
            stringify!(sha1hash)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sha256hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashMech__KeyHashData),
            "::",
            stringify!(sha256hash)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sha512hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashMech__KeyHashData),
            "::",
            stringify!(sha512hash)
        )
    );
}
impl Default for M_KeyHashMech__KeyHashData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyHashMech__KeyHashData {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_KeyHashMech__KeyHashData {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyHashEx {
    pub mech: M_KeyHashMech,
    pub data: M_KeyHashMech__KeyHashData,
}
#[test]
fn bindgen_test_layout_M_KeyHashEx() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyHashEx> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyHashEx>(),
        68usize,
        concat!("Size of: ", stringify!(M_KeyHashEx))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyHashEx>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyHashEx))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mech) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashEx),
            "::",
            stringify!(mech)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyHashEx),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_KeyHashEx {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyHashEx {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyHashEx {{ mech: {:?}, data: {:?} }}",
            self.mech, self.data
        )
    }
}
pub type M_TokenHash = M_Hash;
pub type M_KMHash = M_Hash;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct M_PhysToken {
    pub module: M_ModuleID,
    pub slot: M_SlotID,
    pub ic: M_Word,
}
#[test]
fn bindgen_test_layout_M_PhysToken() {
    const UNINIT: ::core::mem::MaybeUninit<M_PhysToken> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PhysToken>(),
        12usize,
        concat!("Size of: ", stringify!(M_PhysToken))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PhysToken>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PhysToken))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).module) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PhysToken),
            "::",
            stringify!(module)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PhysToken),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ic) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PhysToken),
            "::",
            stringify!(ic)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_SlotType_Unconnected_SlotExData {
    pub stinfo: M_StatusErrorInfo,
}
#[test]
fn bindgen_test_layout_M_SlotType_Unconnected_SlotExData() {
    const UNINIT: ::core::mem::MaybeUninit<M_SlotType_Unconnected_SlotExData> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_SlotType_Unconnected_SlotExData>(),
        32usize,
        concat!("Size of: ", stringify!(M_SlotType_Unconnected_SlotExData))
    );
    assert_eq!(
        ::core::mem::align_of::<M_SlotType_Unconnected_SlotExData>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_SlotType_Unconnected_SlotExData)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_SlotType_Unconnected_SlotExData),
            "::",
            stringify!(stinfo)
        )
    );
}
impl Default for M_SlotType_Unconnected_SlotExData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_SlotType_Unconnected_SlotExData {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_SlotType_Unconnected_SlotExData {{ stinfo: {:?} }}",
            self.stinfo
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_SlotType__SlotExData {
    pub unconnected: M_SlotType_Unconnected_SlotExData,
}
#[test]
fn bindgen_test_layout_M_SlotType__SlotExData() {
    const UNINIT: ::core::mem::MaybeUninit<M_SlotType__SlotExData> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_SlotType__SlotExData>(),
        32usize,
        concat!("Size of: ", stringify!(M_SlotType__SlotExData))
    );
    assert_eq!(
        ::core::mem::align_of::<M_SlotType__SlotExData>(),
        8usize,
        concat!("Alignment of ", stringify!(M_SlotType__SlotExData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unconnected) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_SlotType__SlotExData),
            "::",
            stringify!(unconnected)
        )
    );
}
impl Default for M_SlotType__SlotExData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_SlotType__SlotExData {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_SlotType__SlotExData {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_PlainTextType_Bignum_Data {
    pub m: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Bignum_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Bignum_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Bignum_Data>(),
        8usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Bignum_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Bignum_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Bignum_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Bignum_Data),
            "::",
            stringify!(m)
        )
    );
}
impl Default for M_PlainTextType_Bignum_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_PlainTextType_Bytes_Data {
    pub data: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Bytes_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Bytes_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Bytes_Data>(),
        16usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Bytes_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Bytes_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Bytes_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Bytes_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Bytes_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_ECPoint_flags = M_Word;
pub type M_FieldElement = M_Bignum;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_ECPoint {
    pub flags: M_ECPoint_flags,
    pub x: M_FieldElement,
    pub y: M_FieldElement,
}
#[test]
fn bindgen_test_layout_M_ECPoint() {
    const UNINIT: ::core::mem::MaybeUninit<M_ECPoint> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ECPoint>(),
        24usize,
        concat!("Size of: ", stringify!(M_ECPoint))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ECPoint>(),
        8usize,
        concat!("Alignment of ", stringify!(M_ECPoint))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECPoint),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECPoint),
            "::",
            stringify!(y)
        )
    );
}
impl Default for M_ECPoint {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_PlainTextType_ECPoint_Data {
    pub data: M_ECPoint,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_ECPoint_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_ECPoint_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_ECPoint_Data>(),
        24usize,
        concat!("Size of: ", stringify!(M_PlainTextType_ECPoint_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_ECPoint_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_ECPoint_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_ECPoint_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_ECPoint_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_PlainTextType_Hash_Data {
    pub data: M_Hash,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Hash_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Hash_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Hash_Data>(),
        20usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Hash_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Hash_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Hash_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Hash_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Hash_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType_Hash_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType_Hash_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Hash16 {
    pub bytes: [::core::ffi::c_uchar; 16usize],
    pub words: [M_Word; 4usize],
}
#[test]
fn bindgen_test_layout_M_Hash16() {
    const UNINIT: ::core::mem::MaybeUninit<M_Hash16> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Hash16>(),
        16usize,
        concat!("Size of: ", stringify!(M_Hash16))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Hash16>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Hash16))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash16),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash16),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Hash16 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Hash16 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Hash16 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_PlainTextType_Hash16_Data {
    pub data: M_Hash16,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Hash16_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Hash16_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Hash16_Data>(),
        16usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Hash16_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Hash16_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Hash16_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Hash16_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Hash16_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType_Hash16_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType_Hash16_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Hash24 {
    pub bytes: [::core::ffi::c_uchar; 24usize],
    pub words: [M_Word; 6usize],
}
#[test]
fn bindgen_test_layout_M_Hash24() {
    const UNINIT: ::core::mem::MaybeUninit<M_Hash24> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Hash24>(),
        24usize,
        concat!("Size of: ", stringify!(M_Hash24))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Hash24>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Hash24))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash24),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Hash24),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Hash24 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Hash24 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Hash24 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_PlainTextType_Hash24_Data {
    pub data: M_Hash24,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Hash24_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Hash24_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Hash24_Data>(),
        24usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Hash24_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Hash24_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Hash24_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Hash24_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Hash24_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType_Hash24_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType_Hash24_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_PlainTextType_Hash28_Data {
    pub data: M_Hash28,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Hash28_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Hash28_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Hash28_Data>(),
        28usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Hash28_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Hash28_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Hash28_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Hash28_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Hash28_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType_Hash28_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType_Hash28_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_PlainTextType_Hash32_Data {
    pub data: M_Hash32,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Hash32_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Hash32_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Hash32_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Hash32_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Hash32_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Hash32_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Hash32_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Hash32_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType_Hash32_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType_Hash32_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_PlainTextType_Hash48_Data {
    pub data: M_Hash48,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Hash48_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Hash48_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Hash48_Data>(),
        48usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Hash48_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Hash48_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Hash48_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Hash48_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Hash48_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType_Hash48_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType_Hash48_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_PlainTextType_Hash64_Data {
    pub data: M_Hash64,
}
#[test]
fn bindgen_test_layout_M_PlainTextType_Hash64_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType_Hash64_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType_Hash64_Data>(),
        64usize,
        concat!("Size of: ", stringify!(M_PlainTextType_Hash64_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType_Hash64_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_PlainTextType_Hash64_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType_Hash64_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_PlainTextType_Hash64_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType_Hash64_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType_Hash64_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_PlainTextType__Data {
    pub bignum: M_PlainTextType_Bignum_Data,
    pub bytes: M_PlainTextType_Bytes_Data,
    pub ecpoint: M_PlainTextType_ECPoint_Data,
    pub hash: M_PlainTextType_Hash_Data,
    pub hash16: M_PlainTextType_Hash16_Data,
    pub hash24: M_PlainTextType_Hash24_Data,
    pub hash28: M_PlainTextType_Hash28_Data,
    pub hash32: M_PlainTextType_Hash32_Data,
    pub hash48: M_PlainTextType_Hash48_Data,
    pub hash64: M_PlainTextType_Hash64_Data,
}
#[test]
fn bindgen_test_layout_M_PlainTextType__Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_PlainTextType__Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_PlainTextType__Data>(),
        64usize,
        concat!("Size of: ", stringify!(M_PlainTextType__Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_PlainTextType__Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_PlainTextType__Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bignum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(bignum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ecpoint) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(ecpoint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(hash16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash24) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(hash24)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash28) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(hash28)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(hash32)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash48) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(hash48)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_PlainTextType__Data),
            "::",
            stringify!(hash64)
        )
    );
}
impl Default for M_PlainTextType__Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_PlainTextType__Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_PlainTextType__Data {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_ChannelType__ExtraCOI {
    pub union_is_empty_hack: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_M_ChannelType__ExtraCOI() {
    const UNINIT: ::core::mem::MaybeUninit<M_ChannelType__ExtraCOI> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ChannelType__ExtraCOI>(),
        4usize,
        concat!("Size of: ", stringify!(M_ChannelType__ExtraCOI))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ChannelType__ExtraCOI>(),
        4usize,
        concat!("Alignment of ", stringify!(M_ChannelType__ExtraCOI))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).union_is_empty_hack) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ChannelType__ExtraCOI),
            "::",
            stringify!(union_is_empty_hack)
        )
    );
}
impl Default for M_ChannelType__ExtraCOI {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_ChannelType__ExtraCOI {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_ChannelType__ExtraCOI {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_ChannelOpenInfo {
    pub type_: M_ChannelType,
    pub info: M_ChannelType__ExtraCOI,
}
#[test]
fn bindgen_test_layout_M_ChannelOpenInfo() {
    const UNINIT: ::core::mem::MaybeUninit<M_ChannelOpenInfo> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ChannelOpenInfo>(),
        8usize,
        concat!("Size of: ", stringify!(M_ChannelOpenInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ChannelOpenInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(M_ChannelOpenInfo))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ChannelOpenInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ChannelOpenInfo),
            "::",
            stringify!(info)
        )
    );
}
impl Default for M_ChannelOpenInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_ChannelOpenInfo {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_ChannelOpenInfo {{ type: {:?}, info: {:?} }}",
            self.type_, self.info
        )
    }
}
pub type M_AnyKeyID = M_KeyID;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct M_CertType_SigningKey_CertBody {
    pub key: M_AnyKeyID,
}
#[test]
fn bindgen_test_layout_M_CertType_SigningKey_CertBody() {
    const UNINIT: ::core::mem::MaybeUninit<M_CertType_SigningKey_CertBody> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_CertType_SigningKey_CertBody>(),
        4usize,
        concat!("Size of: ", stringify!(M_CertType_SigningKey_CertBody))
    );
    assert_eq!(
        ::core::mem::align_of::<M_CertType_SigningKey_CertBody>(),
        4usize,
        concat!("Alignment of ", stringify!(M_CertType_SigningKey_CertBody))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_CertType_SigningKey_CertBody),
            "::",
            stringify!(key)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_DESKey {
    pub bytes: [::core::ffi::c_uchar; 8usize],
    pub words: [M_Word; 2usize],
}
#[test]
fn bindgen_test_layout_M_DESKey() {
    const UNINIT: ::core::mem::MaybeUninit<M_DESKey> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_DESKey>(),
        8usize,
        concat!("Size of: ", stringify!(M_DESKey))
    );
    assert_eq!(
        ::core::mem::align_of::<M_DESKey>(),
        4usize,
        concat!("Alignment of ", stringify!(M_DESKey))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DESKey),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DESKey),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_DESKey {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_DESKey {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_DESKey {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_DES_Data {
    pub k: M_DESKey,
}
#[test]
fn bindgen_test_layout_M_KeyType_DES_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DES_Data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DES_Data>(),
        8usize,
        concat!("Size of: ", stringify!(M_KeyType_DES_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DES_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyType_DES_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).k) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DES_Data),
            "::",
            stringify!(k)
        )
    );
}
impl Default for M_KeyType_DES_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_DES_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_KeyType_DES_Data {{ k: {:?} }}", self.k)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_DES2Key {
    pub bytes: [::core::ffi::c_uchar; 16usize],
    pub words: [M_Word; 4usize],
}
#[test]
fn bindgen_test_layout_M_DES2Key() {
    const UNINIT: ::core::mem::MaybeUninit<M_DES2Key> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_DES2Key>(),
        16usize,
        concat!("Size of: ", stringify!(M_DES2Key))
    );
    assert_eq!(
        ::core::mem::align_of::<M_DES2Key>(),
        4usize,
        concat!("Alignment of ", stringify!(M_DES2Key))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DES2Key),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DES2Key),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_DES2Key {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_DES2Key {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_DES2Key {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_DES2_Data {
    pub k: M_DES2Key,
}
#[test]
fn bindgen_test_layout_M_KeyType_DES2_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DES2_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DES2_Data>(),
        16usize,
        concat!("Size of: ", stringify!(M_KeyType_DES2_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DES2_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyType_DES2_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).k) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DES2_Data),
            "::",
            stringify!(k)
        )
    );
}
impl Default for M_KeyType_DES2_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_DES2_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_KeyType_DES2_Data {{ k: {:?} }}", self.k)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_DES3Key {
    pub bytes: [::core::ffi::c_uchar; 24usize],
    pub words: [M_Word; 6usize],
}
#[test]
fn bindgen_test_layout_M_DES3Key() {
    const UNINIT: ::core::mem::MaybeUninit<M_DES3Key> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_DES3Key>(),
        24usize,
        concat!("Size of: ", stringify!(M_DES3Key))
    );
    assert_eq!(
        ::core::mem::align_of::<M_DES3Key>(),
        4usize,
        concat!("Alignment of ", stringify!(M_DES3Key))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DES3Key),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DES3Key),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_DES3Key {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_DES3Key {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_DES3Key {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_DES3_Data {
    pub k: M_DES3Key,
}
#[test]
fn bindgen_test_layout_M_KeyType_DES3_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DES3_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DES3_Data>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_DES3_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DES3_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyType_DES3_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).k) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DES3_Data),
            "::",
            stringify!(k)
        )
    );
}
impl Default for M_KeyType_DES3_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_DES3_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_KeyType_DES3_Data {{ k: {:?} }}", self.k)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_DSADiscreteLogGroup {
    pub p: M_Bignum,
    pub q: M_Bignum,
    pub g: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_DSADiscreteLogGroup() {
    const UNINIT: ::core::mem::MaybeUninit<M_DSADiscreteLogGroup> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_DSADiscreteLogGroup>(),
        24usize,
        concat!("Size of: ", stringify!(M_DSADiscreteLogGroup))
    );
    assert_eq!(
        ::core::mem::align_of::<M_DSADiscreteLogGroup>(),
        8usize,
        concat!("Alignment of ", stringify!(M_DSADiscreteLogGroup))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSADiscreteLogGroup),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSADiscreteLogGroup),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSADiscreteLogGroup),
            "::",
            stringify!(g)
        )
    );
}
impl Default for M_DSADiscreteLogGroup {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_DHExDiscreteLogGroup = M_DSADiscreteLogGroup;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DHExPrivate_Data {
    pub dlg: M_DHExDiscreteLogGroup,
    pub x: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_DHExPrivate_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DHExPrivate_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DHExPrivate_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_KeyType_DHExPrivate_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DHExPrivate_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DHExPrivate_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPrivate_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPrivate_Data),
            "::",
            stringify!(x)
        )
    );
}
impl Default for M_KeyType_DHExPrivate_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DHExPublic_Data {
    pub dlg: M_DHExDiscreteLogGroup,
    pub gx: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_DHExPublic_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DHExPublic_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DHExPublic_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_KeyType_DHExPublic_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DHExPublic_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DHExPublic_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPublic_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gx) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPublic_Data),
            "::",
            stringify!(gx)
        )
    );
}
impl Default for M_KeyType_DHExPublic_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_DiscreteLogGroup {
    pub p: M_Bignum,
    pub g: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_DiscreteLogGroup() {
    const UNINIT: ::core::mem::MaybeUninit<M_DiscreteLogGroup> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_DiscreteLogGroup>(),
        16usize,
        concat!("Size of: ", stringify!(M_DiscreteLogGroup))
    );
    assert_eq!(
        ::core::mem::align_of::<M_DiscreteLogGroup>(),
        8usize,
        concat!("Alignment of ", stringify!(M_DiscreteLogGroup))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DiscreteLogGroup),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DiscreteLogGroup),
            "::",
            stringify!(g)
        )
    );
}
impl Default for M_DiscreteLogGroup {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DHPrivate_Data {
    pub dlg: M_DiscreteLogGroup,
    pub x: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_DHPrivate_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DHPrivate_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DHPrivate_Data>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_DHPrivate_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DHPrivate_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DHPrivate_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPrivate_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPrivate_Data),
            "::",
            stringify!(x)
        )
    );
}
impl Default for M_KeyType_DHPrivate_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DHPublic_Data {
    pub dlg: M_DiscreteLogGroup,
    pub gx: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_DHPublic_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DHPublic_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DHPublic_Data>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_DHPublic_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DHPublic_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DHPublic_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPublic_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPublic_Data),
            "::",
            stringify!(gx)
        )
    );
}
impl Default for M_KeyType_DHPublic_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DKTemplate_Data {
    pub appdata: M_ByteBlock,
    pub nested_acl: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_KeyType_DKTemplate_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DKTemplate_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DKTemplate_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_KeyType_DKTemplate_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DKTemplate_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DKTemplate_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).appdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DKTemplate_Data),
            "::",
            stringify!(appdata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nested_acl) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DKTemplate_Data),
            "::",
            stringify!(nested_acl)
        )
    );
}
impl Default for M_KeyType_DKTemplate_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_DSAInitValues {
    pub seed: M_Hash,
    pub counter: M_Word,
    pub h: M_Word,
}
#[test]
fn bindgen_test_layout_M_DSAInitValues() {
    const UNINIT: ::core::mem::MaybeUninit<M_DSAInitValues> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_DSAInitValues>(),
        28usize,
        concat!("Size of: ", stringify!(M_DSAInitValues))
    );
    assert_eq!(
        ::core::mem::align_of::<M_DSAInitValues>(),
        4usize,
        concat!("Alignment of ", stringify!(M_DSAInitValues))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).seed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSAInitValues),
            "::",
            stringify!(seed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSAInitValues),
            "::",
            stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSAInitValues),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_DSAInitValues {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_DSAInitValues {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_DSAInitValues {{ seed: {:?}, counter: {:?}, h: {:?} }}",
            self.seed, self.counter, self.h
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_DSAComm_Data {
    pub iv: M_DSAInitValues,
    pub dlg: M_DSADiscreteLogGroup,
}
#[test]
fn bindgen_test_layout_M_KeyType_DSAComm_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DSAComm_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DSAComm_Data>(),
        56usize,
        concat!("Size of: ", stringify!(M_KeyType_DSAComm_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DSAComm_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DSAComm_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAComm_Data),
            "::",
            stringify!(iv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAComm_Data),
            "::",
            stringify!(dlg)
        )
    );
}
impl Default for M_KeyType_DSAComm_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_DSAComm_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyType_DSAComm_Data {{ iv: {:?}, dlg: {:?} }}",
            self.iv, self.dlg
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_DSAInitValuesVarSeed {
    pub seed: M_ByteBlock,
    pub counter: M_Word,
    pub h: M_Word,
}
#[test]
fn bindgen_test_layout_M_DSAInitValuesVarSeed() {
    const UNINIT: ::core::mem::MaybeUninit<M_DSAInitValuesVarSeed> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_DSAInitValuesVarSeed>(),
        24usize,
        concat!("Size of: ", stringify!(M_DSAInitValuesVarSeed))
    );
    assert_eq!(
        ::core::mem::align_of::<M_DSAInitValuesVarSeed>(),
        8usize,
        concat!("Alignment of ", stringify!(M_DSAInitValuesVarSeed))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).seed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSAInitValuesVarSeed),
            "::",
            stringify!(seed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSAInitValuesVarSeed),
            "::",
            stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(M_DSAInitValuesVarSeed),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_DSAInitValuesVarSeed {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DSACommVariableSeed_Data {
    pub iv: M_DSAInitValuesVarSeed,
    pub dlg: M_DSADiscreteLogGroup,
}
#[test]
fn bindgen_test_layout_M_KeyType_DSACommVariableSeed_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DSACommVariableSeed_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DSACommVariableSeed_Data>(),
        48usize,
        concat!("Size of: ", stringify!(M_KeyType_DSACommVariableSeed_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DSACommVariableSeed_Data>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_KeyType_DSACommVariableSeed_Data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSACommVariableSeed_Data),
            "::",
            stringify!(iv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSACommVariableSeed_Data),
            "::",
            stringify!(dlg)
        )
    );
}
impl Default for M_KeyType_DSACommVariableSeed_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DSAPrivate_Data {
    pub dlg: M_DSADiscreteLogGroup,
    pub x: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_DSAPrivate_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DSAPrivate_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DSAPrivate_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_KeyType_DSAPrivate_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DSAPrivate_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DSAPrivate_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPrivate_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPrivate_Data),
            "::",
            stringify!(x)
        )
    );
}
impl Default for M_KeyType_DSAPrivate_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DSAPublic_Data {
    pub dlg: M_DSADiscreteLogGroup,
    pub y: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_DSAPublic_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DSAPublic_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DSAPublic_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_KeyType_DSAPublic_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DSAPublic_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DSAPublic_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPublic_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPublic_Data),
            "::",
            stringify!(y)
        )
    );
}
impl Default for M_KeyType_DSAPublic_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_FieldType_Binary_Data_flags = M_Word;
pub type M_vec_Word = *mut M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_FieldType_Binary_Data {
    pub flags: M_FieldType_Binary_Data_flags,
    pub n_exponents: ::core::ffi::c_int,
    pub exponents: M_vec_Word,
    pub beta: *mut M_Bignum,
}
#[test]
fn bindgen_test_layout_M_FieldType_Binary_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_FieldType_Binary_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_FieldType_Binary_Data>(),
        24usize,
        concat!("Size of: ", stringify!(M_FieldType_Binary_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_FieldType_Binary_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_FieldType_Binary_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType_Binary_Data),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_exponents) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType_Binary_Data),
            "::",
            stringify!(n_exponents)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exponents) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType_Binary_Data),
            "::",
            stringify!(exponents)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).beta) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType_Binary_Data),
            "::",
            stringify!(beta)
        )
    );
}
impl Default for M_FieldType_Binary_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_FieldType_Prime_Data_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_FieldType_Prime_Data {
    pub flags: M_FieldType_Prime_Data_flags,
    pub p: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_FieldType_Prime_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_FieldType_Prime_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_FieldType_Prime_Data>(),
        16usize,
        concat!("Size of: ", stringify!(M_FieldType_Prime_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_FieldType_Prime_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_FieldType_Prime_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType_Prime_Data),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType_Prime_Data),
            "::",
            stringify!(p)
        )
    );
}
impl Default for M_FieldType_Prime_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_FieldType__Data {
    pub binary: M_FieldType_Binary_Data,
    pub prime: M_FieldType_Prime_Data,
}
#[test]
fn bindgen_test_layout_M_FieldType__Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_FieldType__Data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_FieldType__Data>(),
        24usize,
        concat!("Size of: ", stringify!(M_FieldType__Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_FieldType__Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_FieldType__Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).binary) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType__Data),
            "::",
            stringify!(binary)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prime) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_FieldType__Data),
            "::",
            stringify!(prime)
        )
    );
}
impl Default for M_FieldType__Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_FieldType__Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_FieldType__Data {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Field {
    pub type_: M_FieldType,
    pub data: M_FieldType__Data,
}
#[test]
fn bindgen_test_layout_M_Field() {
    const UNINIT: ::core::mem::MaybeUninit<M_Field> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Field>(),
        32usize,
        concat!("Size of: ", stringify!(M_Field))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Field>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Field))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Field),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Field),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_Field {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Field {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_Field {{ type: {:?}, data: {:?} }}",
            self.type_, self.data
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_ECName_Custom_Data {
    pub F: M_Field,
    pub a: M_FieldElement,
    pub b: M_FieldElement,
    pub g: M_ECPoint,
    pub r: M_Bignum,
    pub h: M_Word,
}
#[test]
fn bindgen_test_layout_M_ECName_Custom_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_ECName_Custom_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ECName_Custom_Data>(),
        88usize,
        concat!("Size of: ", stringify!(M_ECName_Custom_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ECName_Custom_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_ECName_Custom_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).F) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_Custom_Data),
            "::",
            stringify!(F)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_Custom_Data),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_Custom_Data),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_Custom_Data),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_Custom_Data),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_Custom_Data),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_ECName_Custom_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_ECName_Custom_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_ECName_Custom_Data {{ F: {:?}, a: {:?}, b: {:?}, g: {:?}, r: {:?}, h: {:?} }}",
            self.F, self.a, self.b, self.g, self.r, self.h
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_ECName_CustomLCF_Data {
    pub F: M_Field,
    pub a: M_FieldElement,
    pub b: M_FieldElement,
    pub g: M_ECPoint,
    pub r: M_Bignum,
    pub h: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_ECName_CustomLCF_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_ECName_CustomLCF_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ECName_CustomLCF_Data>(),
        88usize,
        concat!("Size of: ", stringify!(M_ECName_CustomLCF_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ECName_CustomLCF_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_ECName_CustomLCF_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).F) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_CustomLCF_Data),
            "::",
            stringify!(F)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_CustomLCF_Data),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_CustomLCF_Data),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_CustomLCF_Data),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_CustomLCF_Data),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName_CustomLCF_Data),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_ECName_CustomLCF_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_ECName_CustomLCF_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_ECName_CustomLCF_Data {{ F: {:?}, a: {:?}, b: {:?}, g: {:?}, r: {:?}, h: {:?} }}",
            self.F, self.a, self.b, self.g, self.r, self.h
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_ECName__Data {
    pub custom: M_ECName_Custom_Data,
    pub customlcf: M_ECName_CustomLCF_Data,
}
#[test]
fn bindgen_test_layout_M_ECName__Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_ECName__Data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_ECName__Data>(),
        88usize,
        concat!("Size of: ", stringify!(M_ECName__Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_ECName__Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_ECName__Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).custom) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName__Data),
            "::",
            stringify!(custom)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).customlcf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_ECName__Data),
            "::",
            stringify!(customlcf)
        )
    );
}
impl Default for M_ECName__Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_ECName__Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_ECName__Data {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_EllipticCurve {
    pub name: M_ECName,
    pub data: M_ECName__Data,
}
#[test]
fn bindgen_test_layout_M_EllipticCurve() {
    const UNINIT: ::core::mem::MaybeUninit<M_EllipticCurve> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_EllipticCurve>(),
        96usize,
        concat!("Size of: ", stringify!(M_EllipticCurve))
    );
    assert_eq!(
        ::core::mem::align_of::<M_EllipticCurve>(),
        8usize,
        concat!("Alignment of ", stringify!(M_EllipticCurve))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_EllipticCurve),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_EllipticCurve),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_EllipticCurve {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_EllipticCurve {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_EllipticCurve {{ name: {:?}, data: {:?} }}",
            self.name, self.data
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_ECPrivate_Data {
    pub curve: M_EllipticCurve,
    pub d: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_ECPrivate_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_ECPrivate_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_ECPrivate_Data>(),
        104usize,
        concat!("Size of: ", stringify!(M_KeyType_ECPrivate_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_ECPrivate_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_ECPrivate_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).curve) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_ECPrivate_Data),
            "::",
            stringify!(curve)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_ECPrivate_Data),
            "::",
            stringify!(d)
        )
    );
}
impl Default for M_KeyType_ECPrivate_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_ECPrivate_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyType_ECPrivate_Data {{ curve: {:?}, d: {:?} }}",
            self.curve, self.d
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_ECPublic_Data {
    pub curve: M_EllipticCurve,
    pub Q: M_ECPoint,
}
#[test]
fn bindgen_test_layout_M_KeyType_ECPublic_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_ECPublic_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_ECPublic_Data>(),
        120usize,
        concat!("Size of: ", stringify!(M_KeyType_ECPublic_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_ECPublic_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_ECPublic_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).curve) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_ECPublic_Data),
            "::",
            stringify!(curve)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Q) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_ECPublic_Data),
            "::",
            stringify!(Q)
        )
    );
}
impl Default for M_KeyType_ECPublic_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_ECPublic_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyType_ECPublic_Data {{ curve: {:?}, Q: {:?} }}",
            self.curve, self.Q
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KCDSAInitValues {
    pub seed: M_ByteBlock,
    pub counter: M_Word,
}
#[test]
fn bindgen_test_layout_M_KCDSAInitValues() {
    const UNINIT: ::core::mem::MaybeUninit<M_KCDSAInitValues> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KCDSAInitValues>(),
        24usize,
        concat!("Size of: ", stringify!(M_KCDSAInitValues))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KCDSAInitValues>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KCDSAInitValues))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).seed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KCDSAInitValues),
            "::",
            stringify!(seed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KCDSAInitValues),
            "::",
            stringify!(counter)
        )
    );
}
impl Default for M_KCDSAInitValues {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KCDSADiscreteLogGroup = M_DSADiscreteLogGroup;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_KCDSAComm_Data {
    pub iv: M_KCDSAInitValues,
    pub dlg: M_KCDSADiscreteLogGroup,
}
#[test]
fn bindgen_test_layout_M_KeyType_KCDSAComm_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_KCDSAComm_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_KCDSAComm_Data>(),
        48usize,
        concat!("Size of: ", stringify!(M_KeyType_KCDSAComm_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_KCDSAComm_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_KCDSAComm_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAComm_Data),
            "::",
            stringify!(iv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAComm_Data),
            "::",
            stringify!(dlg)
        )
    );
}
impl Default for M_KeyType_KCDSAComm_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_KCDSAPrivate_Data {
    pub dlg: M_KCDSADiscreteLogGroup,
    pub y: M_Bignum,
    pub x: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_KCDSAPrivate_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_KCDSAPrivate_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_KCDSAPrivate_Data>(),
        40usize,
        concat!("Size of: ", stringify!(M_KeyType_KCDSAPrivate_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_KCDSAPrivate_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_KCDSAPrivate_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPrivate_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPrivate_Data),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPrivate_Data),
            "::",
            stringify!(x)
        )
    );
}
impl Default for M_KeyType_KCDSAPrivate_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_KCDSAPublic_Data {
    pub dlg: M_KCDSADiscreteLogGroup,
    pub y: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_KCDSAPublic_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_KCDSAPublic_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_KCDSAPublic_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_KeyType_KCDSAPublic_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_KCDSAPublic_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_KCDSAPublic_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPublic_Data),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPublic_Data),
            "::",
            stringify!(y)
        )
    );
}
impl Default for M_KeyType_KCDSAPublic_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_RSAPrivate_Data {
    pub p: M_Bignum,
    pub q: M_Bignum,
    pub dmp1: M_Bignum,
    pub dmq1: M_Bignum,
    pub iqmp: M_Bignum,
    pub e: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_RSAPrivate_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_RSAPrivate_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_RSAPrivate_Data>(),
        48usize,
        concat!("Size of: ", stringify!(M_KeyType_RSAPrivate_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_RSAPrivate_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_RSAPrivate_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_Data),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_Data),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dmp1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_Data),
            "::",
            stringify!(dmp1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dmq1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_Data),
            "::",
            stringify!(dmq1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iqmp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_Data),
            "::",
            stringify!(iqmp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).e) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_Data),
            "::",
            stringify!(e)
        )
    );
}
impl Default for M_KeyType_RSAPrivate_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_RSAPublic_Data {
    pub e: M_Bignum,
    pub n: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_KeyType_RSAPublic_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_RSAPublic_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_RSAPublic_Data>(),
        16usize,
        concat!("Size of: ", stringify!(M_KeyType_RSAPublic_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_RSAPublic_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_RSAPublic_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).e) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPublic_Data),
            "::",
            stringify!(e)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPublic_Data),
            "::",
            stringify!(n)
        )
    );
}
impl Default for M_KeyType_RSAPublic_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_Random_Data {
    pub k: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_KeyType_Random_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_Random_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_Random_Data>(),
        16usize,
        concat!("Size of: ", stringify!(M_KeyType_Random_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_Random_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_Random_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).k) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_Random_Data),
            "::",
            stringify!(k)
        )
    );
}
impl Default for M_KeyType_Random_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_TUAKTOP {
    pub bytes: [::core::ffi::c_uchar; 32usize],
    pub words: [M_Word; 8usize],
}
#[test]
fn bindgen_test_layout_M_TUAKTOP() {
    const UNINIT: ::core::mem::MaybeUninit<M_TUAKTOP> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_TUAKTOP>(),
        32usize,
        concat!("Size of: ", stringify!(M_TUAKTOP))
    );
    assert_eq!(
        ::core::mem::align_of::<M_TUAKTOP>(),
        4usize,
        concat!("Alignment of ", stringify!(M_TUAKTOP))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_TUAKTOP),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_TUAKTOP),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_TUAKTOP {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_TUAKTOP {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_TUAKTOP {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_TUAKTOP_Data {
    pub data: M_TUAKTOP,
}
#[test]
fn bindgen_test_layout_M_KeyType_TUAKTOP_Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_TUAKTOP_Data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_TUAKTOP_Data>(),
        32usize,
        concat!("Size of: ", stringify!(M_KeyType_TUAKTOP_Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_TUAKTOP_Data>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyType_TUAKTOP_Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_TUAKTOP_Data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_KeyType_TUAKTOP_Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_TUAKTOP_Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_KeyType_TUAKTOP_Data {{ data: {:?} }}", self.data)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_KeyType__Data {
    pub des: M_KeyType_DES_Data,
    pub des2: M_KeyType_DES2_Data,
    pub des3: M_KeyType_DES3_Data,
    pub dhexprivate: M_KeyType_DHExPrivate_Data,
    pub dhexpublic: M_KeyType_DHExPublic_Data,
    pub dhprivate: M_KeyType_DHPrivate_Data,
    pub dhpublic: M_KeyType_DHPublic_Data,
    pub dktemplate: M_KeyType_DKTemplate_Data,
    pub dsacomm: M_KeyType_DSAComm_Data,
    pub dsacommvariableseed: M_KeyType_DSACommVariableSeed_Data,
    pub dsaprivate: M_KeyType_DSAPrivate_Data,
    pub dsapublic: M_KeyType_DSAPublic_Data,
    pub ecprivate: M_KeyType_ECPrivate_Data,
    pub ecpublic: M_KeyType_ECPublic_Data,
    pub kcdsacomm: M_KeyType_KCDSAComm_Data,
    pub kcdsaprivate: M_KeyType_KCDSAPrivate_Data,
    pub kcdsapublic: M_KeyType_KCDSAPublic_Data,
    pub rsaprivate: M_KeyType_RSAPrivate_Data,
    pub rsapublic: M_KeyType_RSAPublic_Data,
    pub random: M_KeyType_Random_Data,
    pub tuaktop: M_KeyType_TUAKTOP_Data,
}
#[test]
fn bindgen_test_layout_M_KeyType__Data() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType__Data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType__Data>(),
        120usize,
        concat!("Size of: ", stringify!(M_KeyType__Data))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType__Data>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType__Data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).des) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(des)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).des2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(des2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).des3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(des3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dhexprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dhexprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dhexpublic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dhexpublic)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dhprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dhprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dhpublic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dhpublic)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dktemplate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dktemplate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsacomm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dsacomm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsacommvariableseed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dsacommvariableseed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsaprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dsaprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsapublic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(dsapublic)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ecprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(ecprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ecpublic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(ecpublic)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).kcdsacomm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(kcdsacomm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).kcdsaprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(kcdsaprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).kcdsapublic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(kcdsapublic)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rsaprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(rsaprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rsapublic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(rsapublic)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).random) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(random)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tuaktop) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__Data),
            "::",
            stringify!(tuaktop)
        )
    );
}
impl Default for M_KeyType__Data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType__Data {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_KeyType__Data {{ union }}")
    }
}
pub type M_KeyType_DHExPrivate_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DHExPrivate_GenParams {
    pub flags: M_KeyType_DHExPrivate_GenParams_flags,
    pub plength: M_Word,
    pub qlength: M_Word,
    pub dlg: *mut M_DHExDiscreteLogGroup,
}
#[test]
fn bindgen_test_layout_M_KeyType_DHExPrivate_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DHExPrivate_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DHExPrivate_GenParams>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_DHExPrivate_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DHExPrivate_GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DHExPrivate_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPrivate_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).plength) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPrivate_GenParams),
            "::",
            stringify!(plength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qlength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPrivate_GenParams),
            "::",
            stringify!(qlength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHExPrivate_GenParams),
            "::",
            stringify!(dlg)
        )
    );
}
impl Default for M_KeyType_DHExPrivate_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KeyType_DHPrivate_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DHPrivate_GenParams {
    pub flags: M_KeyType_DHPrivate_GenParams_flags,
    pub plength: M_Word,
    pub xlength: M_Word,
    pub dlg: *mut M_DiscreteLogGroup,
}
#[test]
fn bindgen_test_layout_M_KeyType_DHPrivate_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DHPrivate_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DHPrivate_GenParams>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_DHPrivate_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DHPrivate_GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DHPrivate_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPrivate_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).plength) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPrivate_GenParams),
            "::",
            stringify!(plength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xlength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPrivate_GenParams),
            "::",
            stringify!(xlength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DHPrivate_GenParams),
            "::",
            stringify!(dlg)
        )
    );
}
impl Default for M_KeyType_DHPrivate_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KeyType_DSAComm_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DSAComm_GenParams {
    pub flags: M_KeyType_DSAComm_GenParams_flags,
    pub lenbits: M_Word,
    pub iv: *mut M_DSAInitValues,
}
#[test]
fn bindgen_test_layout_M_KeyType_DSAComm_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DSAComm_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DSAComm_GenParams>(),
        16usize,
        concat!("Size of: ", stringify!(M_KeyType_DSAComm_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DSAComm_GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DSAComm_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAComm_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lenbits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAComm_GenParams),
            "::",
            stringify!(lenbits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAComm_GenParams),
            "::",
            stringify!(iv)
        )
    );
}
impl Default for M_KeyType_DSAComm_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KeyType_DSACommVariableSeed_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DSACommVariableSeed_GenParams {
    pub flags: M_KeyType_DSACommVariableSeed_GenParams_flags,
    pub lenbits: M_Word,
    pub iv: *mut M_DSAInitValuesVarSeed,
    pub qhash: *mut M_DSAGenerationHash,
}
#[test]
fn bindgen_test_layout_M_KeyType_DSACommVariableSeed_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DSACommVariableSeed_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DSACommVariableSeed_GenParams>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(M_KeyType_DSACommVariableSeed_GenParams)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DSACommVariableSeed_GenParams>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_KeyType_DSACommVariableSeed_GenParams)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSACommVariableSeed_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lenbits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSACommVariableSeed_GenParams),
            "::",
            stringify!(lenbits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSACommVariableSeed_GenParams),
            "::",
            stringify!(iv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qhash) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSACommVariableSeed_GenParams),
            "::",
            stringify!(qhash)
        )
    );
}
impl Default for M_KeyType_DSACommVariableSeed_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KeyType_DSAPrivate_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_DSAPrivate_GenParams {
    pub flags: M_KeyType_DSAPrivate_GenParams_flags,
    pub lenbits: M_Word,
    pub dlg: *mut M_DSADiscreteLogGroup,
    pub qhash: *mut M_DSAGenerationHash,
}
#[test]
fn bindgen_test_layout_M_KeyType_DSAPrivate_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_DSAPrivate_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_DSAPrivate_GenParams>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_DSAPrivate_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_DSAPrivate_GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_DSAPrivate_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPrivate_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lenbits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPrivate_GenParams),
            "::",
            stringify!(lenbits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPrivate_GenParams),
            "::",
            stringify!(dlg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qhash) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_DSAPrivate_GenParams),
            "::",
            stringify!(qhash)
        )
    );
}
impl Default for M_KeyType_DSAPrivate_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyType_ECPrivate_GenParams {
    pub curve: M_EllipticCurve,
}
#[test]
fn bindgen_test_layout_M_KeyType_ECPrivate_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_ECPrivate_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_ECPrivate_GenParams>(),
        96usize,
        concat!("Size of: ", stringify!(M_KeyType_ECPrivate_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_ECPrivate_GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_ECPrivate_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).curve) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_ECPrivate_GenParams),
            "::",
            stringify!(curve)
        )
    );
}
impl Default for M_KeyType_ECPrivate_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType_ECPrivate_GenParams {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyType_ECPrivate_GenParams {{ curve: {:?} }}",
            self.curve
        )
    }
}
pub type M_KeyType_KCDSAComm_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_KCDSAComm_GenParams {
    pub flags: M_KeyType_KCDSAComm_GenParams_flags,
    pub plen: M_Word,
    pub qlen: M_Word,
    pub iv: *mut M_KCDSAInitValues,
}
#[test]
fn bindgen_test_layout_M_KeyType_KCDSAComm_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_KCDSAComm_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_KCDSAComm_GenParams>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_KCDSAComm_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_KCDSAComm_GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_KCDSAComm_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAComm_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).plen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAComm_GenParams),
            "::",
            stringify!(plen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qlen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAComm_GenParams),
            "::",
            stringify!(qlen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iv) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAComm_GenParams),
            "::",
            stringify!(iv)
        )
    );
}
impl Default for M_KeyType_KCDSAComm_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KeyType_KCDSAPrivate_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_KCDSAPrivate_GenParams {
    pub flags: M_KeyType_KCDSAPrivate_GenParams_flags,
    pub plen: M_Word,
    pub qlen: M_Word,
    pub dlg: *mut M_KCDSADiscreteLogGroup,
}
#[test]
fn bindgen_test_layout_M_KeyType_KCDSAPrivate_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_KCDSAPrivate_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_KCDSAPrivate_GenParams>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_KCDSAPrivate_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_KCDSAPrivate_GenParams>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(M_KeyType_KCDSAPrivate_GenParams)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPrivate_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).plen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPrivate_GenParams),
            "::",
            stringify!(plen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qlen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPrivate_GenParams),
            "::",
            stringify!(qlen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dlg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_KCDSAPrivate_GenParams),
            "::",
            stringify!(dlg)
        )
    );
}
impl Default for M_KeyType_KCDSAPrivate_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type M_KeyType_RSAPrivate_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_KeyType_RSAPrivate_GenParams {
    pub flags: M_KeyType_RSAPrivate_GenParams_flags,
    pub lenbits: M_Word,
    pub given_e: *mut M_Bignum,
    pub nchecks: *mut M_Word,
}
#[test]
fn bindgen_test_layout_M_KeyType_RSAPrivate_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_RSAPrivate_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_RSAPrivate_GenParams>(),
        24usize,
        concat!("Size of: ", stringify!(M_KeyType_RSAPrivate_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_RSAPrivate_GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType_RSAPrivate_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lenbits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_GenParams),
            "::",
            stringify!(lenbits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).given_e) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_GenParams),
            "::",
            stringify!(given_e)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nchecks) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_RSAPrivate_GenParams),
            "::",
            stringify!(nchecks)
        )
    );
}
impl Default for M_KeyType_RSAPrivate_GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct M_KeyType_Random_GenParams {
    pub lenbytes: M_Word,
}
#[test]
fn bindgen_test_layout_M_KeyType_Random_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_Random_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_Random_GenParams>(),
        4usize,
        concat!("Size of: ", stringify!(M_KeyType_Random_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_Random_GenParams>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyType_Random_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lenbytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_Random_GenParams),
            "::",
            stringify!(lenbytes)
        )
    );
}
pub type M_KeyType_Wrapped_GenParams_flags = M_Word;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct M_KeyType_Wrapped_GenParams {
    pub flags: M_KeyType_Wrapped_GenParams_flags,
    pub length: M_Word,
}
#[test]
fn bindgen_test_layout_M_KeyType_Wrapped_GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType_Wrapped_GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType_Wrapped_GenParams>(),
        8usize,
        concat!("Size of: ", stringify!(M_KeyType_Wrapped_GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType_Wrapped_GenParams>(),
        4usize,
        concat!("Alignment of ", stringify!(M_KeyType_Wrapped_GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_Wrapped_GenParams),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType_Wrapped_GenParams),
            "::",
            stringify!(length)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_KeyType__GenParams {
    pub dhexprivate: M_KeyType_DHExPrivate_GenParams,
    pub dhprivate: M_KeyType_DHPrivate_GenParams,
    pub dsacomm: M_KeyType_DSAComm_GenParams,
    pub dsacommvariableseed: M_KeyType_DSACommVariableSeed_GenParams,
    pub dsaprivate: M_KeyType_DSAPrivate_GenParams,
    pub ecprivate: M_KeyType_ECPrivate_GenParams,
    pub kcdsacomm: M_KeyType_KCDSAComm_GenParams,
    pub kcdsaprivate: M_KeyType_KCDSAPrivate_GenParams,
    pub rsaprivate: M_KeyType_RSAPrivate_GenParams,
    pub random: M_KeyType_Random_GenParams,
    pub wrapped: M_KeyType_Wrapped_GenParams,
}
#[test]
fn bindgen_test_layout_M_KeyType__GenParams() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyType__GenParams> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyType__GenParams>(),
        96usize,
        concat!("Size of: ", stringify!(M_KeyType__GenParams))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyType__GenParams>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyType__GenParams))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dhexprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(dhexprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dhprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(dhprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsacomm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(dsacomm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsacommvariableseed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(dsacommvariableseed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsaprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(dsaprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ecprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(ecprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).kcdsacomm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(kcdsacomm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).kcdsaprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(kcdsaprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rsaprivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(rsaprivate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).random) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(random)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wrapped) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyType__GenParams),
            "::",
            stringify!(wrapped)
        )
    );
}
impl Default for M_KeyType__GenParams {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyType__GenParams {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_KeyType__GenParams {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_KeyData {
    pub type_: M_KeyType,
    pub data: M_KeyType__Data,
}
#[test]
fn bindgen_test_layout_M_KeyData() {
    const UNINIT: ::core::mem::MaybeUninit<M_KeyData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_KeyData>(),
        128usize,
        concat!("Size of: ", stringify!(M_KeyData))
    );
    assert_eq!(
        ::core::mem::align_of::<M_KeyData>(),
        8usize,
        concat!("Alignment of ", stringify!(M_KeyData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyData),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_KeyData),
            "::",
            stringify!(data)
        )
    );
}
impl Default for M_KeyData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_KeyData {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_KeyData {{ type: {:?}, data: {:?} }}",
            self.type_, self.data
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_ArcFourpNONE_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_ArcFourpNONE_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_ArcFourpNONE_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_ArcFourpNONE_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_ArcFourpNONE_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_ArcFourpNONE_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_ArcFourpNONE_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_ArcFourpNONE_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_ArcFourpNONE_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_BlobCrypt_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_BlobCrypt_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_BlobCrypt_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_BlobCrypt_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_BlobCrypt_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_BlobCrypt_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_BlobCrypt_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_BlobCrypt_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_BlobCrypt_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_DHExKeyExchange_Cipher {
    pub gx: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_Mech_DHExKeyExchange_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_DHExKeyExchange_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_DHExKeyExchange_Cipher>(),
        8usize,
        concat!("Size of: ", stringify!(M_Mech_DHExKeyExchange_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_DHExKeyExchange_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_DHExKeyExchange_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_DHExKeyExchange_Cipher),
            "::",
            stringify!(gx)
        )
    );
}
impl Default for M_Mech_DHExKeyExchange_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_DHKeyExchange_Cipher {
    pub gx: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_Mech_DHKeyExchange_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_DHKeyExchange_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_DHKeyExchange_Cipher>(),
        8usize,
        concat!("Size of: ", stringify!(M_Mech_DHKeyExchange_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_DHKeyExchange_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_DHKeyExchange_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_DHKeyExchange_Cipher),
            "::",
            stringify!(gx)
        )
    );
}
impl Default for M_Mech_DHKeyExchange_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_DLIESe3DEShSHA1_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_DLIESe3DEShSHA1_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_DLIESe3DEShSHA1_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_DLIESe3DEShSHA1_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_DLIESe3DEShSHA1_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_DLIESe3DEShSHA1_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_DLIESe3DEShSHA1_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_DLIESe3DEShSHA1_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_DLIESe3DEShSHA1_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_DSA_Cipher {
    pub r: M_Bignum,
    pub s: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_Mech_DSA_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_DSA_Cipher> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_DSA_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_DSA_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_DSA_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_DSA_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_DSA_Cipher),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_DSA_Cipher),
            "::",
            stringify!(s)
        )
    );
}
impl Default for M_Mech_DSA_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_ECDHKeyExchange_Cipher {
    pub gd: M_ECPoint,
}
#[test]
fn bindgen_test_layout_M_Mech_ECDHKeyExchange_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_ECDHKeyExchange_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_ECDHKeyExchange_Cipher>(),
        24usize,
        concat!("Size of: ", stringify!(M_Mech_ECDHKeyExchange_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_ECDHKeyExchange_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_ECDHKeyExchange_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_ECDHKeyExchange_Cipher),
            "::",
            stringify!(gd)
        )
    );
}
impl Default for M_Mech_ECDHKeyExchange_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_ECDSA_Cipher {
    pub r: M_Bignum,
    pub s: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_Mech_ECDSA_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_ECDSA_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_ECDSA_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_ECDSA_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_ECDSA_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_ECDSA_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_ECDSA_Cipher),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_ECDSA_Cipher),
            "::",
            stringify!(s)
        )
    );
}
impl Default for M_Mech_ECDSA_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_Ed25519ph_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_Ed25519ph_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Ed25519ph_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Ed25519ph_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_Ed25519ph_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Ed25519ph_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_Ed25519ph_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Ed25519ph_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_Ed25519ph_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_ElGamal_Cipher {
    pub a: M_Bignum,
    pub b: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_Mech_ElGamal_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_ElGamal_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_ElGamal_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_ElGamal_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_ElGamal_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_ElGamal_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_ElGamal_Cipher),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_ElGamal_Cipher),
            "::",
            stringify!(b)
        )
    );
}
impl Default for M_Mech_ElGamal_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_Generic128_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_Generic128_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Generic128_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Generic128_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_Generic128_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Generic128_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_Generic128_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Generic128_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_Generic128_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Block128 {
    pub bytes: [::core::ffi::c_uchar; 16usize],
    pub words: [M_Word; 4usize],
}
#[test]
fn bindgen_test_layout_M_Block128() {
    const UNINIT: ::core::mem::MaybeUninit<M_Block128> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Block128>(),
        16usize,
        concat!("Size of: ", stringify!(M_Block128))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Block128>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Block128))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Block128),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Block128),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Block128 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Block128 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Block128 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_Generic128MAC_Cipher {
    pub mac: M_Block128,
}
#[test]
fn bindgen_test_layout_M_Mech_Generic128MAC_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Generic128MAC_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Generic128MAC_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_Generic128MAC_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Generic128MAC_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_Generic128MAC_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Generic128MAC_Cipher),
            "::",
            stringify!(mac)
        )
    );
}
impl Default for M_Mech_Generic128MAC_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_Generic128MAC_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_Generic128MAC_Cipher {{ mac: {:?} }}", self.mac)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_Generic192_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_Generic192_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Generic192_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Generic192_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_Generic192_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Generic192_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_Generic192_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Generic192_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_Generic192_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_Generic256_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_Generic256_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Generic256_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Generic256_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_Generic256_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Generic256_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_Generic256_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Generic256_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_Generic256_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_Generic64_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_Generic64_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Generic64_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Generic64_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_Generic64_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Generic64_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_Generic64_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Generic64_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_Generic64_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Block64 {
    pub bytes: [::core::ffi::c_uchar; 8usize],
    pub words: [M_Word; 2usize],
}
#[test]
fn bindgen_test_layout_M_Block64() {
    const UNINIT: ::core::mem::MaybeUninit<M_Block64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Block64>(),
        8usize,
        concat!("Size of: ", stringify!(M_Block64))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Block64>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Block64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Block64),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).words) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Block64),
            "::",
            stringify!(words)
        )
    );
}
impl Default for M_Block64 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Block64 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Block64 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_Generic64MAC_Cipher {
    pub mac: M_Block64,
}
#[test]
fn bindgen_test_layout_M_Mech_Generic64MAC_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Generic64MAC_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Generic64MAC_Cipher>(),
        8usize,
        concat!("Size of: ", stringify!(M_Mech_Generic64MAC_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Generic64MAC_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_Generic64MAC_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Generic64MAC_Cipher),
            "::",
            stringify!(mac)
        )
    );
}
impl Default for M_Mech_Generic64MAC_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_Generic64MAC_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_Generic64MAC_Cipher {{ mac: {:?} }}", self.mac)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_GenericGCM128_Cipher {
    pub cipher: M_ByteBlock,
    pub tag: M_Block128,
}
#[test]
fn bindgen_test_layout_M_Mech_GenericGCM128_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_GenericGCM128_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_GenericGCM128_Cipher>(),
        32usize,
        concat!("Size of: ", stringify!(M_Mech_GenericGCM128_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_GenericGCM128_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_GenericGCM128_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_GenericGCM128_Cipher),
            "::",
            stringify!(cipher)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_GenericGCM128_Cipher),
            "::",
            stringify!(tag)
        )
    );
}
impl Default for M_Mech_GenericGCM128_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_GenericGCM128_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "M_Mech_GenericGCM128_Cipher {{ cipher: {:?}, tag: {:?} }}",
            self.cipher, self.tag
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_HAS160Hash_Cipher {
    pub h: M_Hash20,
}
#[test]
fn bindgen_test_layout_M_Mech_HAS160Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_HAS160Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_HAS160Hash_Cipher>(),
        20usize,
        concat!("Size of: ", stringify!(M_Mech_HAS160Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_HAS160Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_HAS160Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_HAS160Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_HAS160Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_HAS160Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_HAS160Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_Imech_Cipher {
    pub c: M_ByteBlock,
    pub len: M_Word,
}
#[test]
fn bindgen_test_layout_M_Mech_Imech_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_Imech_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_Imech_Cipher>(),
        24usize,
        concat!("Size of: ", stringify!(M_Mech_Imech_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_Imech_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_Imech_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Imech_Cipher),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_Imech_Cipher),
            "::",
            stringify!(len)
        )
    );
}
impl Default for M_Mech_Imech_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_KCDSAHAS160_Cipher {
    pub r: M_ByteBlock,
    pub s: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_Mech_KCDSAHAS160_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_KCDSAHAS160_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_KCDSAHAS160_Cipher>(),
        24usize,
        concat!("Size of: ", stringify!(M_Mech_KCDSAHAS160_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_KCDSAHAS160_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_KCDSAHAS160_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_KCDSAHAS160_Cipher),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_KCDSAHAS160_Cipher),
            "::",
            stringify!(s)
        )
    );
}
impl Default for M_Mech_KCDSAHAS160_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_MD5Hash_Cipher {
    pub h: M_Hash16,
}
#[test]
fn bindgen_test_layout_M_Mech_MD5Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_MD5Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_MD5Hash_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_MD5Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_MD5Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_MD5Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_MD5Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_MD5Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_MD5Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_MD5Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_RIPEMD160Hash_Cipher {
    pub h: M_Hash20,
}
#[test]
fn bindgen_test_layout_M_Mech_RIPEMD160Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_RIPEMD160Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_RIPEMD160Hash_Cipher>(),
        20usize,
        concat!("Size of: ", stringify!(M_Mech_RIPEMD160Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_RIPEMD160Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_RIPEMD160Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_RIPEMD160Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_RIPEMD160Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_RIPEMD160Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_RIPEMD160Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_RSApPKCS1_Cipher {
    pub m: M_Bignum,
}
#[test]
fn bindgen_test_layout_M_Mech_RSApPKCS1_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_RSApPKCS1_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_RSApPKCS1_Cipher>(),
        8usize,
        concat!("Size of: ", stringify!(M_Mech_RSApPKCS1_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_RSApPKCS1_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_RSApPKCS1_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_RSApPKCS1_Cipher),
            "::",
            stringify!(m)
        )
    );
}
impl Default for M_Mech_RSApPKCS1_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct M_Mech_RSApPKCS1pPKCS11_Cipher {
    pub cipher: M_ByteBlock,
}
#[test]
fn bindgen_test_layout_M_Mech_RSApPKCS1pPKCS11_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_RSApPKCS1pPKCS11_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_RSApPKCS1pPKCS11_Cipher>(),
        16usize,
        concat!("Size of: ", stringify!(M_Mech_RSApPKCS1pPKCS11_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_RSApPKCS1pPKCS11_Cipher>(),
        8usize,
        concat!("Alignment of ", stringify!(M_Mech_RSApPKCS1pPKCS11_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cipher) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_RSApPKCS1pPKCS11_Cipher),
            "::",
            stringify!(cipher)
        )
    );
}
impl Default for M_Mech_RSApPKCS1pPKCS11_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_SHA1Hash_Cipher {
    pub h: M_Hash20,
}
#[test]
fn bindgen_test_layout_M_Mech_SHA1Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_SHA1Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_SHA1Hash_Cipher>(),
        20usize,
        concat!("Size of: ", stringify!(M_Mech_SHA1Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_SHA1Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_SHA1Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_SHA1Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_SHA1Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_SHA1Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_SHA1Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_SHA224Hash_Cipher {
    pub h: M_Hash28,
}
#[test]
fn bindgen_test_layout_M_Mech_SHA224Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_SHA224Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_SHA224Hash_Cipher>(),
        28usize,
        concat!("Size of: ", stringify!(M_Mech_SHA224Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_SHA224Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_SHA224Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_SHA224Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_SHA224Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_SHA224Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_SHA224Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_SHA256Hash_Cipher {
    pub h: M_Hash32,
}
#[test]
fn bindgen_test_layout_M_Mech_SHA256Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_SHA256Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_SHA256Hash_Cipher>(),
        32usize,
        concat!("Size of: ", stringify!(M_Mech_SHA256Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_SHA256Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_SHA256Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_SHA256Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_SHA256Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_SHA256Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_SHA256Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_SHA384Hash_Cipher {
    pub h: M_Hash48,
}
#[test]
fn bindgen_test_layout_M_Mech_SHA384Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_SHA384Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_SHA384Hash_Cipher>(),
        48usize,
        concat!("Size of: ", stringify!(M_Mech_SHA384Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_SHA384Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_SHA384Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_SHA384Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_SHA384Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_SHA384Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_SHA384Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_SHA512Hash_Cipher {
    pub h: M_Hash64,
}
#[test]
fn bindgen_test_layout_M_Mech_SHA512Hash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_SHA512Hash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_SHA512Hash_Cipher>(),
        64usize,
        concat!("Size of: ", stringify!(M_Mech_SHA512Hash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_SHA512Hash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_SHA512Hash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_SHA512Hash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_SHA512Hash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_SHA512Hash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_SHA512Hash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct M_Mech_TigerHash_Cipher {
    pub h: M_Hash24,
}
#[test]
fn bindgen_test_layout_M_Mech_TigerHash_Cipher() {
    const UNINIT: ::core::mem::MaybeUninit<M_Mech_TigerHash_Cipher> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<M_Mech_TigerHash_Cipher>(),
        24usize,
        concat!("Size of: ", stringify!(M_Mech_TigerHash_Cipher))
    );
    assert_eq!(
        ::core::mem::align_of::<M_Mech_TigerHash_Cipher>(),
        4usize,
        concat!("Alignment of ", stringify!(M_Mech_TigerHash_Cipher))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(M_Mech_TigerHash_Cipher),
            "::",
            stringify!(h)
        )
    );
}
impl Default for M_Mech_TigerHash_Cipher {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for M_Mech_TigerHash_Cipher {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "M_Mech_TigerHash_Cipher {{ h: {:?} }}", self.h)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union M_Mech__Cipher {
    pub arcfourpnone: M_Mech_ArcFourpNONE_Cipher,
    pub blobcrypt: M_Mech_BlobCrypt_Cipher,
    pub dhexkeyexchange: M_Mech_DHExKeyExchange_Cipher,
    pub dhkeyexchange: M_Mech_DHKeyExchange_Cipher,
    pub dliese3deshsha1: M_Mech_DLIESe3DEShSHA1_Cipher,
    pub dsa: M_Mech_DSA_Cipher,
    pub ecdhkeyexchange: M_Mech_ECDHKeyExchange_Cipher,
    pub ecdsa: M_Mech_ECDSA_Cipher,
